[{"number": "Refcard #277", "title": "CI/CD With Containers", "subtitle": "", "description": "Containers and orchestration tools have often been cited as ways to facilitate continuous delivery and continuous integration. Download this Refcard to learn about the challenges and solutions to utilizing containers in your DevOps pipeline.", "download": "/asset/download/263342", "url": "https://dzone.com/refcardz/cicd-with-containers"}, {"number": "Refcard #233", "title": "Getting Started With Kubernetes", "subtitle": "An open-source orchestration system for managing containerized applications across multiple hosts.", "description": "Containers weighing you down? Kubernetes can scale them. In order to run and maintain successful containerized applications, organization is key. Kubernetes is a powerful system that provides a method for managing Docker and Rocket containers across multiple hosts. This Refcard has all you need to know about Kubernetes including how to begin using it, how to successfully build your first pod and scale intelligently, and more.", "download": "/asset/download/257346", "url": "https://dzone.com/refcardz/kubernetes-essentials"}, {"number": "Refcard #230", "title": "Java Containerization", "subtitle": "Containerizing Your Java Applications", "description": "This Refcard focuses on the design, deployment, service discovery, and management of Java applications on the open-source project called Docker so that you can get your Java application up and running inside a Docker-deployed Linux container. Expand your knowledge with extensive code snippets, informative diagrams, and workflow tips.", "download": "/asset/download/250347", "url": "https://dzone.com/refcardz/java-containerization"}, {"number": "Refcard #271", "title": "Compliant DevOps", "subtitle": "", "description": "With new data protection laws coming into play, and consumers more aware than ever before of how their privacy is being compromised, there is now a requirement for companies to adopt a compliant DevOps approach. Download this Refcard to discover the best practices to adopt compliant DevOps.", "download": "/asset/download/249335", "url": "https://dzone.com/refcardz/compliant-devops"}, {"number": "Refcard #236", "title": "Introduction to Docker Monitoring", "subtitle": "Making Microservices a Reality", "description": "Docker has rapidly evolved into a production-ready infrastructure platform, promising flexible and scalable delivery of software to end users. This Refcard looks into the challenges that containers (or black boxes) present in DevOps, explores architectural models for monitoring containers, and investigates pros and cons of Docker monitoring and troubleshooting options. It also covers a complex, real-world example with Sysdig Cloud to understand what to monitor and how.", "download": "/asset/download/240354", "url": "https://dzone.com/refcardz/intro-to-docker-monitoring"}, {"number": "Refcard #267", "title": "Introduction to DevSecOps", "subtitle": "", "description": "With DevSecOps, you can reach higher security standards while following DevOps principles. This Refcard will show you how to get started with DevSecOps with key themes, crucial steps to begin your journey, and a guide to choosing security tools and technologies to build your DevSecOps pipeline.", "download": "/asset/download/236338", "url": "https://dzone.com/refcardz/introduction-to-devsecops"}, {"number": "Refcard #265", "title": "Understanding Stream Processing", "subtitle": "Fast Processing of Infinite and Big Data", "description": "Stream processing is incredibly useful for processing big data volumes and providing useful insights in real-time. This is especially important when the value of the information in the data decreases as it gets older. This Refcard covers the building blocks of a stream processing solution, use cases that benefit from stream processing, and hands-on examples using Hazelcast Jet.", "download": "/asset/download/231354", "url": "https://dzone.com/refcardz/understanding-stream-processing"}, {"number": "Refcard #263", "title": "Messaging Infrastructure for IoT at Scale", "subtitle": "", "description": "IoT technology is all around us and can no longer be ignored. At the core of IoT technology is the messaging infrastructure. Download this Refcard to learn more about the foundation of an IoT platform, how to get started with EnMasse, and open source projects focused on IoT device connectivity.", "download": "/asset/download/224341", "url": "https://dzone.com/refcardz/messaging-infrastructure-for-iot-at-scale"}, {"number": "Refcard #259", "title": "Test Design Automation", "subtitle": "Driving Testing at the Speed of Agile", "description": "Download this new Refcard to get started with test design automation, explore the many benefits, and find real-world use cases.", "download": "/asset/download/221331", "url": "https://dzone.com/refcardz/test-design-automation"}, {"number": "Refcard #257", "title": "Getting Started With Kotlin", "subtitle": "", "description": "Kotlin has become one of the most popular JVM languages in the past few months, partly because it experienced a lot of attention in the Android community after Google made Kotlin an official language for Android development. Download this Refcard to start working with this open-source language, which can be found on GitHub.", "download": "/asset/download/231338", "url": "https://dzone.com/refcardz/getting-started-with-kotlin"}, {"number": "Refcard #254", "title": "Apache Kafka", "subtitle": "", "description": "Download this new Refcard to get started with Apache Kafka. Learn more about its background, steps to run the quickstart script, components, and how to connect REST APIs.", "download": "/asset/download/204336", "url": "https://dzone.com/refcardz/apache-kafka"}, {"number": "Refcard #252", "title": "Graph-Powered Search: Neo4j & Elasticsearch", "subtitle": "", "description": "See how combining technologies adds another level of quality to search results. In this new Refcard, we include code and examples for using Elasticsearch to enable full-text search and Neo4j to power graph-aided search.", "download": "/asset/download/202331", "url": "https://dzone.com/refcardz/graph-powered-search-neo4j-amp-elasticsearch"}, {"number": "Refcard #249", "title": "An Overview of GraphQL", "subtitle": "A New Paradigm for Building APIs", "description": "As an alternative to REST, GraphQL is quickly gaining popularity as a tool for building APIs. This Refcard introduces GraphQL concepts such as the GraphQL type system and schema, and demonstrates how to build a GraphQL service that connects to a database using JavaScript.", "download": "/asset/download/191140", "url": "https://dzone.com/refcardz/an-overview-of-graphql"}, {"number": "Refcard #221", "title": "Getting Started With Docker", "subtitle": "The De Facto Open-Source Containerization Solution", "description": "In what seems like an instant, Docker has become the benchmark for organizations to automate infrastructure, isolate applications, maintain consistency, and improve resource utilizations. In this Refcard, learn how to run a container, explore several useful commands, and discover how to create local Docker machines.", "download": "/asset/download/185031", "url": "https://dzone.com/refcardz/getting-started-with-docker-1"}, {"number": "Refcard #243", "title": "Getting Started With Java-Based CMS", "subtitle": "Using Content Management Systems in Java Applications", "description": "In this Refcard, learn to create a Content Management System to craft and deploy content-enabled digital experiences quickly. Learn to create and deploy content-enabled digital experiences quickly. Additionally, walk through the process of putting a modern CMS into practice, from installation to project creation.", "download": "/asset/download/179031", "url": "https://dzone.com/refcardz/getting-started-with-java-based-cms"}, {"number": "Refcard #240", "title": "Reactive Microservices With Lagom and Java", "subtitle": "The Reactive Microservices Framework", "description": "Building Reactive Systems can be hard, but Lagom abstracts the complexities away. Using this open-source framework, you can build Microservices as reactive systems that are elastic and resilient from within. Lagom also provides a development environment that saves you from monotonous setup and scripting, allowing you to use a single command to build your project and start your services.", "download": "/asset/download/169038", "url": "https://dzone.com/refcardz/reactive-microservices-with-lagom-and-java"}, {"number": "Refcard #239", "title": "Getting Started With Appium", "subtitle": "Mobile App Automation Made Awesome", "description": "In this Refcard you will learn everything you need to know about getting started with this open-source tool, from installing the Appium server to running your first tests. Download this Refcard now to see why Appium is \"Mobile App Automation Made Awesome.\"", "download": "/asset/download/161035", "url": "https://dzone.com/refcardz/getting-started-with-appium"}, {"number": "Refcard #180", "title": "Preparing for Continuous Delivery", "subtitle": "Building Your DevOps Pipeline", "description": "Continuous delivery is the practice of releasing in frequent, short delivery cycles, enabling constant improvement of your application. In this Refcard you will learn the fundamentals of continuous delivery, including how to set up your delivery pipeline, putting you one step closer to decreased cycle times and faster delivery.", "download": "/asset/download/156031", "url": "https://dzone.com/refcardz/preparing-continuous-delivery"}, {"number": "Refcard #237", "title": ".NET on Linux", "subtitle": "Microsoft's powerful framework on open source's most popular OS.", "description": "This Refcard guides you through productively using .NET on Linux, from installation to debugging. You will find an architectural overview, tips for using the new Command Line Interface (CLI), and tools and helpful settings as they relate to your development efforts. This Refcard also covers building MVC web sites, RESTful services, and standalone applications.", "download": "/asset/download/188033", "url": "https://dzone.com/refcardz/net-on-linux"}, {"number": "Refcard #032", "title": "Getting Started with Hibernate Search", "subtitle": "The Key to Effective ORM", "description": "Hibernate Search is an extension to Hibernate ORM that adds powerful capabilities, boosting the power and efficiency of queries. It depends on Apache Lucene and is typically used to implement “full-text search.” This newly updated Refcard breaks down getting started with Hibernate Search and searching your database. Learn more about configuration properties, mapping entities and executing queries, synchronizing the index and database, and more.", "download": "/asset/download/129033", "url": "https://dzone.com/refcardz/getting-started-with-hibernate"}, {"number": "Refcard #215", "title": "Getting Started With Microservices", "subtitle": "Design Patterns for Decomposing the Monolith", "description": "Welcome to the world of microservices, where continuous deployment isn’t just an aspiration, but a reality. With microservices, you can ditch the complexities of monolithic architecture for the nimble and flexible approach that embraces the “do one thing, and do it well” mentality. In this updated Refcard, you will learn why microservices are becoming the cornerstone of modern architecture, how to begin refactoring your monolithic application, and common patterns to help you get started.", "download": "/asset/download/116831", "url": "https://dzone.com/refcardz/getting-started-with-microservices"}, {"number": "Refcard #207", "title": "Cloud Foundry", "subtitle": "Open-Source PaaS for Streamlined Development and Deployment", "description": "Covers technologies supported by Cloud Foundry, finding a hosting provider, writing apps for and deploying to Cloud Foundry, scaling and managing apps in the cloud, and more.", "download": "/asset/download/101831", "url": "https://dzone.com/refcardz/cloud-foundry"}, {"number": "Refcard #203", "title": "Querying Graphs with Neo4j", "subtitle": "An Open-Source, NoSQL Graph Database Limited Only By Hardware", "description": "Independent of the size of the total dataset, graph databases excel at managing highly connected data and complex queries. Armed only with a pattern and a set of starting points, graph databases explore the larger neighborhoods around these initial entities — collecting and aggregating information from millions of nodes and relationships — but leaving the billions outside the search perimeter untouched.", "download": "/asset/download/89832", "url": "https://dzone.com/refcardz/querying-graphs-neo4j"}, {"number": "Refcard #227", "title": "Reactive Programming in JavaScript With RxJS", "subtitle": "Using Streams for Event-Driven Web Applications", "description": "Web application code quickly becomes tangled, hard to maintain, and hard to test. The problem is that asynchronous computations are inherently difficult to manage. RxJS solves async without the callback pyramid of doom.", "download": "/asset/download/210339", "url": "https://dzone.com/refcardz/rxjs-streams"}, {"number": "Refcard #224", "title": "React.js Essentials", "subtitle": "The Simple Front-end Library for User Interfaces", "description": "Gives you the essentials of React.js, from the architecture to the virtual DOM, from building components to styling them.", "download": "/asset/download/70432", "url": "https://dzone.com/refcardz/reactjs-essentials"}, {"number": "Refcard #024", "title": "Core Java", "subtitle": "A Power-User's Guide to Java", "description": "Gives you an overview of key aspects of the Java language and references on the core library, commonly used tools, and Java 8 features.", "download": "/asset/download/51834", "url": "https://dzone.com/refcardz/core-java"}, {"number": "Refcard #216", "title": "Java Caching", "subtitle": "Strategies and the JCache API", "description": "Explores the building blocks of JCache and other caching APIs, as well as multiple strategies for implementing temporary data storage in your application.", "download": "/asset/download/41831", "url": "https://dzone.com/refcardz/java-caching"}, {"number": "Refcard #071", "title": "Essential PostgreSQL", "subtitle": "Become a PostgreSQL Power User", "description": "Navigates PostgreSQL’s most popular features and hidden gems and covers topics such as configuration, administration, language support, and more.", "download": "/asset/download/5332", "url": "https://dzone.com/refcardz/essential-postgresql"}, {"number": "Refcard #016", "title": "C# Development", "subtitle": "13 Things Every C# Developer Should Know", "description": "Gives 13 useful tips and references for using C#, a simple, modern, general purpose, object-oriented, multi-paradigm programming language.", "download": "/asset/download/252", "url": "https://dzone.com/refcardz/csharp"}, {"number": "Refcard #196", "title": "Regular Expressions", "subtitle": "A Look at Characters, Types, Operators, and More", "description": "Covers basic features of regular expressions, including normal and special characters, quantifiers, capturing and non-capturing groups.", "download": "/asset/download/127", "url": "https://dzone.com/refcardz/regular-expressions"}, {"number": "Refcard #191", "title": "Getting Started With PhoneGap", "subtitle": "The Framework for Hybrid Mobile Apps", "description": "Provides an introduction to PhoneGap, and is intended for experienced developers who have a basic conceptual grasp of mobile app development.", "download": "/asset/download/145", "url": "https://dzone.com/refcardz/getting-started-phonegap"}, {"number": "Refcard #187", "title": "Spring Batch", "subtitle": "A Lightweight, Open Source Java Framework for Batch Processing", "description": "Covers the core framework and additional components that provides developers to build robust batch applications that are used in everyday enterprise environments.", "download": "/asset/download/154", "url": "https://dzone.com/refcardz/spring-batch-refcard"}, {"number": "Refcard #183", "title": "Practical Data Mining with Python", "subtitle": "Discovering and Visualizing Patterns with Python", "description": "Covers the tools used in practical Data Mining for finding and describing structural patterns in data using Python.", "download": "/asset/download/161", "url": "https://dzone.com/refcardz/data-mining-discovering-and"}, {"number": "Refcard #177", "title": "HTML5 Web Workers", "subtitle": "Multithreaded JavaScript for High-Performance Web Applications", "description": "Covers the basics of Web Workers, including: creating workers, passing messages, handling errors and best practices.", "download": "/asset/download/144", "url": "https://dzone.com/refcardz/html5-web-workers"}, {"number": "Refcard #173", "title": "Core JSON", "subtitle": "The Fat-Free Alternative to XML", "description": "Covers JSON syntax, validation, modeling, JSON Schema. Includes tips and tricks for using JSON with various tools and programming languages.", "download": "/asset/download/165", "url": "https://dzone.com/refcardz/core-json"}, {"number": "Refcard #168", "title": "Refactoring Patterns", "subtitle": "Learn About an Awesome Code Transformation", "description": "Provides examples of Refactoring patterns that can be used in a variety of scenarios.", "download": "/asset/download/175", "url": "https://dzone.com/refcardz/refactoring-patterns"}, {"number": "Refcard #163", "title": "Code Gems for Android Developers", "subtitle": "Working with the World's Most Popular Mobile OS", "description": "Provides an overview of the API and Tools to develop applications using the Java platform.", "download": "/asset/download/222", "url": "https://dzone.com/refcardz/android-application"}, {"number": "Refcard #159", "title": "Essential Apache HBase", "subtitle": "Learn HBase: the NoSQL Database for Hadoop and Big Data", "description": "HBase Tutorial - Learn HBase quickly with this beginner's introduction to the Hadoop database: a distributed, scalable Big Data store for managing very large tables.", "download": "/asset/download/249", "url": "https://dzone.com/refcardz/hbase"}, {"number": "Refcard #155", "title": "Mockito", "subtitle": "A Simple, Intuitive Mocking Framework", "description": "Covers the testing framework for Java that automatoes unit tests using Test-Driven Deployment or Behavior-Driven Deployment.", "download": "/asset/download/256", "url": "https://dzone.com/refcardz/mockito"}, {"number": "Refcard #015", "title": "Groovy", "subtitle": "A Rapid-Development JVM Language", "description": "Shows you best practices and idiomatic solutions to help you achieve solutions that fully leverage the power of the Groovy language.", "download": "/asset/download/267", "url": "https://dzone.com/refcardz/groovy"}, {"number": "Refcard #008", "title": "Design Patterns", "subtitle": "Building Maintainable and Scalable Software", "description": "Learn design patterns quickly with Jason McDonald's outstanding tutorial on the original 23 Gang of Four design patterns, including class diagrams, explanations, usage info, and real world examples.", "download": "/asset/download/191142", "url": "https://dzone.com/refcardz/design-patterns"}, {"number": "Refcard #146", "title": "Flex Mobile Development", "subtitle": "Build Apps for Android, iOS, and BlackBerry Tablet OS", "description": "The Flex Mobile Development Refcard will walk you through the easiest process yet for developing and deploying cross-platform applications on multiple devices and platforms with the richness that you expect out of an Adobe creative tool.", "download": "/asset/download/38", "url": "https://dzone.com/refcardz/flex-mobile-development-build"}, {"number": "Refcard #139", "title": "Spring Roo", "subtitle": "Open-Source Rapid Application Development for Java", "description": "Get started on your first project with theg Spring Roo open source RAD. You'll be guided through the source code, common commands, dynamic finders, remoting support, incremental database reverse engineering, and removing Spring Roo.", "download": "/asset/download/25", "url": "https://dzone.com/refcardz/spring-roo-open-source-rapid"}, {"number": "Refcard #136", "title": "WebMatrix", "subtitle": "Advanced Web Development Made Simple", "description": "Learn to make a website quickly without having to build it from scratch. WebMatrix is a powerful, task-focused tool that is designed to make it easy to create, customize and publish websites based on open source technologies.", "download": "/asset/download/18", "url": "https://dzone.com/refcardz/webmatrix"}, {"number": "Refcard #132", "title": "Mastering Portals with a Portlet Bridge", "subtitle": "Learn to Configure JBoss Portlet Bridge", "description": "Learn to configure the JBoss Portlet Bridge, which will alow you to run application frameworks in a portal environment without worrying about the underlying portlet API or portlet concepts.", "download": "", "url": "https://dzone.com/refcardz/mastering-portals-portlet"}, {"number": "Refcard #128", "title": "What's New in JPA 2.0", "subtitle": "JPA 2.0: A Java Persistence Update", "description": "Covers JDBC Properties, Access Mode, Mappings, Shared Cache, the TypedQuery interface, JPQL, Pessimistic Locking, the Criteria API and Validation.", "download": "/asset/download/43", "url": "https://dzone.com/refcardz/whats-new-jpa-20"}, {"number": "Refcard #123", "title": "HTML5: The Evolution of Web Standards", "subtitle": "The Next Generation in Web Standards", "description": "Highlights the major improvements and new features in HTML5 and illustrates the JavaScript APIs available to work with those features.", "download": "/asset/download/192133", "url": "https://dzone.com/refcardz/html5-new-standards-web-interactivity"}, {"number": "Refcard #119", "title": "Getting Started with Application Lifecycle Management", "subtitle": "Your Guide to ALM", "description": "Offers advice on change request tracking, inventory control, process automation, deployment automation, compliance reporting, and ALM.", "download": "/asset/download/106", "url": "https://dzone.com/refcardz/getting-started-application"}, {"number": "Refcard #113", "title": "Getting Started With Adobe Flash Catalyst", "subtitle": "Codeless Web and App Design", "description": "Provides you with an excellent introduction to Adobe Flash Catalyst and its features.", "download": "/asset/download/129", "url": "https://dzone.com/refcardz/getting-started-adobe-flash-0"}, {"number": "Refcard #109", "title": "Getting Started with Kanban for Software Development", "subtitle": "A Lightweight Work Management Technique", "description": "Learn to smooth out kinks in the arrival of new development work with a Kanban card board and a work queue.", "download": "/asset/download/111", "url": "https://dzone.com/refcardz/getting-started-kanban"}, {"number": "Refcard #105", "title": "Getting Started with NoSQL and Data Scalability", "subtitle": "Intro to MongoDB, XAP, and Google Datastore", "description": "Learn about core concepts of NoSQL high availability and scalability terminology and techniques, and how to apply them to MongoDB and XAP.", "download": "/asset/download/169", "url": "https://dzone.com/refcardz/getting-started-nosql-and-data"}, {"number": "Refcard #101", "title": "JDBC Best Practices", "subtitle": "Use JDBC Like a Pro", "description": "Learn advanced JDBC, a data access standard for Java, on codeless configuration, SSO, debugging, and logging.", "download": "/asset/download/206", "url": "https://dzone.com/refcardz/jdbc-best-practices"}, {"number": "Refcard #095", "title": "Getting Started with Java GUI Development", "subtitle": "Building a Swing Application", "description": "To develop standalone Java apps, developers can use either Java Swing or SWT. This Refcard will help users get started with either.", "download": "/asset/download/231", "url": "https://dzone.com/refcardz/getting-started-java-gui"}, {"number": "Refcard #089", "title": "Getting Started with the Zend Framework", "subtitle": "Learning to Master the PHP Framework", "description": "Introduces you to the basics of the Zend Framework, such as prerequisites, installation, and creating your first project.", "download": "/asset/download/189", "url": "https://dzone.com/refcardz/getting-started-zend-framework"}, {"number": "Refcard #079", "title": "Google App Engine for Java", "subtitle": "Google's PaaS for Java", "description": "Covers the basics of compiling, deploying, and data storage to GAE's specialized capabilities and supporting frameworks.", "download": "/asset/download/248", "url": "https://dzone.com/refcardz/google-app-engine-java"}, {"number": "Refcard #074", "title": "Agile Adoption: Improving Software Quality", "subtitle": "Reducing Bugs and Improving Design", "description": "Gives you a quick introduction to Agile practices and strategies for adopting the practices in your organization.", "download": "/asset/download/243", "url": "https://dzone.com/refcardz/agile-adoption-improving"}, {"number": "Refcard #069", "title": "Getting Started with ASP.NET MVC 1.0", "subtitle": "Setting Up An Environment and Creating a Web Application", "description": "Explains how to setup your environment to work with ASP.NET MVC and how to create an ASP.NET MVC Web application", "download": "/asset/download/176", "url": "https://dzone.com/refcardz/getting-started-aspnet-mvc-10"}, {"number": "Refcard #062", "title": "Getting Started with Eclipse RCP", "subtitle": "Providing a Foundation for Building and Deploying Rich Client Applications", "description": "Introduces you to the Eclipse plug-in development environment and shows you how to add key functionality to your RCP application.", "download": "/asset/download/199", "url": "https://dzone.com/refcardz/getting-started-eclipse-rcp"}, {"number": "Refcard #057", "title": "Getting Started with Spring-DM", "subtitle": "Bringing Spring and OSGi Together", "description": "Shows you how to use Spring-DM to wire together OSGi services to build highly modular and dynamic applications.", "download": "/asset/download/208", "url": "https://dzone.com/refcardz/getting-started-spring-dm"}, {"number": "Refcard #053", "title": "Getting Started With db4o", "subtitle": "Persisting .NET Object Data", "description": "Walks you through db4o's basic operations, its various query types, and techniques for optimal data access performance.", "download": "/asset/download/215", "url": "https://dzone.com/refcardz/getting-started-db4o"}, {"number": "Refcard #047", "title": "The Top Twelve Integration Patterns for Apache Camel", "subtitle": "Implement in Java or Spring XML", "description": "Check out the 12 most common integration patterns and implementation methods for Apache Camel.", "download": "/asset/download/232", "url": "https://dzone.com/refcardz/enterprise-integration"}, {"number": "Refcard #042", "title": "Seam UI", "subtitle": "Building a Java Interface", "description": "Introduces Seam, a next generation web framework that integrates Java EE technologies with a wide variety of non-standard technologies.", "download": "/asset/download/211", "url": "https://dzone.com/refcardz/seam-ui"}, {"number": "Refcard #036", "title": "Core Mule", "subtitle": "Mule in a Nutshell", "description": "Summarizes the Mule architecture and shows the different routers, transformers, and filters available, including example configurations.", "download": "/asset/download/186", "url": "https://dzone.com/refcardz/core-mule"}, {"number": "Refcard #034", "title": "Core CSS: Part III", "subtitle": "The CSS Way", "description": "Covers Core principles of CSS that will expand and strengthen your professional ability to work with CSS. Part three of three.", "download": "/asset/download/168", "url": "https://dzone.com/refcardz/corecss3"}, {"number": "Refcard #029", "title": "Essential MySQL", "subtitle": "Exploring the World's Most Popular Open Source Database", "description": "Navigates some of MySQL’s most popular features, including configuration, administration software, backup procedures, SQL features, and user management.", "download": "/asset/download/157", "url": "https://dzone.com/refcardz/essential-mysql"}, {"number": "Refcard #27", "title": "Getting Started with MyEclipse", "subtitle": "A More Productive Eclipse", "description": "Introduces MyEclipse, the #1 commercial Eclipse-based IDE, and provides valuable knowledge and helpful tools to help begin and deploy projects.", "download": "/asset/download/139", "url": "https://dzone.com/refcardz/myeclipse"}, {"number": "Refcard #019", "title": "Core CSS: Part I", "subtitle": "First Steps in CSS", "description": "Covers Core principles of CSS that will expand and strengthen your professional ability to work with CSS. Part one of three.", "download": "/asset/download/126", "url": "https://dzone.com/refcardz/corecss-part1"}, {"number": "Refcard #012", "title": "Getting Started with GlassFish", "subtitle": "The GlassFish Application Server Version 3", "description": "A must-have for anyone new to the GlassFish Java application server. It covers version 3 of GlassFish.", "download": "/asset/download/24", "url": "https://dzone.com/refcardz/glassfish-application-server"}, {"number": "Refcard #006", "title": "Dependency Injection in EJB 3", "subtitle": "Empowering Enterprise Java Developers", "description": "Shows you Enterprise JavaBeans, a component model/framework that lets you build enterprise Java applications.", "download": "/asset/download/10", "url": "https://dzone.com/refcardz/dependency-injection-in-ejb3"}, {"number": "Refcard #248", "title": "Java Application Vulnerabilities", "subtitle": "What They Are and How to Fix Them", "description": "Java Applications, like any other, are susceptible to gaps in security. This Refcard focuses on the top vulnerabilities that can affect Java applications and how to combat them.", "download": "/asset/download/262333", "url": "https://dzone.com/refcardz/java-application-vulnerabilities"}, {"number": "Refcard #275", "title": "Kubernetes Security", "subtitle": "", "description": "This Refcard will teach you the essentials of security in Kubernetes, addressing topics like container network access, user authorization, service token access, and more. You’ll discover how to secure exposed network services, learn about threat vectors for Kubernetes deployments, and see how to authenticate users in Kubernetes.", "download": "/asset/download/257334", "url": "https://dzone.com/refcardz/kubernetes-security-1"}, {"number": "Refcard #153", "title": "Apache Cassandra", "subtitle": "A Fault-Tolerant, Massively Scalable NoSQL Database", "description": "Covers data model, architecture, partitioning, strategies, indexes, libraries in various languages, and more.", "download": "/asset/download/250344", "url": "https://dzone.com/refcardz/apache-cassandra"}, {"number": "Refcard #270", "title": "Persistent Container Storage", "subtitle": "", "description": "Containers are great for building applications with ephemeral data. But what if you need your data to persist? Download this Refcard to learn what you need for container storage, discover the benefits of cloud-native storage, and more!", "download": "/asset/download/251331", "url": "https://dzone.com/refcardz/persistent-container-storage"}, {"number": "Refcard #269", "title": "Understanding Data Quality", "subtitle": "", "description": "Data is one of the single most important resources for an organization. It can be used to help your business run smoothly, implement new strategies, and more. This Refcard will show you the key places data derives from, characteristics of high-quality data, and the five phases of a data quality strategy that you can follow.", "download": "/asset/download/241331", "url": "https://dzone.com/refcardz/understanding-data-quality"}, {"number": "Refcard #085", "title": "Getting Started With Vaadin 10", "subtitle": "Modern Web Apps in Java", "description": "Vaadin makes it quick and simple to create HTML user interfaces using Java. Using a built-in selection of components, themes, data binding, and more, Vaadin is the ideal in web application development frameworks.", "download": "/asset/download/236336", "url": "https://dzone.com/refcardz/getting-started-vaadin"}, {"number": "Refcard #093", "title": "Lean Software Development", "subtitle": "", "description": "Many companies have a major opportunity to optimize efficiency and minimize waste in the development of their software using lean software development practices, yet many have simply not discovered the methodology. For those who have attempted to adopt this concept, most discussions and literature don’t provide specific, easy-to-follow practices for implementing lean software development. This Refcard fills the gap by covering a step-by-step approach to carrying out a lean software development process, including best practices to streamline your technology value stream.", "download": "/asset/download/232341", "url": "https://dzone.com/refcardz/getting-started-lean-software"}, {"number": "Refcard #262", "title": "Introduction to DevOps Analytics", "subtitle": "", "description": "Discover the hidden value of using historical data to analyze and estimate a probabilistic measure of the success of a new release. This Refcard goes in-depth on the process to make the delivery lifecycle more efficient, the best analytics-as-a-service (AaaS) tools to use, and dashboards that will effectively help you display and understand your data.", "download": "/asset/download/226331", "url": "https://dzone.com/refcardz/introduction-to-devops-analytics"}, {"number": "Refcard #141", "title": "Node.js", "subtitle": "Server-Side JavaScript for Backends, API Servers, and Web Apps", "description": "Node.js is a JavaScript runtime that runs on top of Google’s open-source JavaScript engine called V8. Pairing JavaScript’s naturally event-driven, asynchronous coding style with non-blocking I/O libraries makes Node.js fast, lightweight, and efficient. This newly updated Refcard introduces Node, explains how it works, and dives into its architecture. Learn how to install and use Node to its full potential and access a list of the most commonly used APIs.", "download": "/asset/download/217337", "url": "https://dzone.com/refcardz/nodejs"}, {"number": "Refcard #256", "title": "Getting Started With Ethereum Private Blockchain", "subtitle": "", "description": "Ethereum is a programmable blockchain that allows users to create their own operations. This Refcard highlights fundamental information on Ethereum Blockchain and demonstrates the steps to get a private blockchain up and running. By the end, you will be able to set up two running nodes on one local machine.", "download": "/asset/download/210343", "url": "https://dzone.com/refcardz/getting-started-with-etherium-private-blockchain"}, {"number": "Refcard #253", "title": "Introduction to Web Components", "subtitle": "", "description": "Download this new Refcard to learn more about Web Components. Newly named Java Champion Kito Mann walks you through the process from set up to using helpful libraries.", "download": "/asset/download/202338", "url": "https://dzone.com/refcardz/introduction-to-web-components-and-polymer"}, {"number": "Refcard #234", "title": "Microservices in Java", "subtitle": "Microservices patterns to support building systems that are tolerant of failure.", "description": "How quickly can you stand up a new Java microservice? You've either bought the idea of microservices – isn't this just the UNIX philosophy generalized? – or you're wondering how we're not just going to rehearse the migraines of CORBA and DCOM and EJB. Nice concept, but the devil is in the implementation details. This Refcard turns concepts into code and lets you jump on the design and runtime scalability train right away – complete with working Java snippets that run the twelve-factor gamut from config to service registration and discovery to load balancing, gateways, circuit breakers, cluster coordination, security, and more.", "download": "/asset/download/197134", "url": "https://dzone.com/refcardz/learn-microservices-in-java"}, {"number": "Refcard #202", "title": "Getting Started With Play Framework", "subtitle": "A Web Framework for Java and Scala", "description": "The Play Framework drastically improves developer productivity without sacrificing scalability. In this Refcard, learn how to create a new Play app, how to utilize controllers in Play, and how to manage routing requests within this web framework.", "download": "/asset/download/188032", "url": "https://dzone.com/refcardz/getting-started-play-framework"}, {"number": "Refcard #246", "title": "Continuous Testing 101", "subtitle": "The Key to In-Sprint Testing", "description": "There are many misconceptions as to what Continuous Testing is. Is it the same thing as Continuous Delivery? It’s probably a QA-led activity, right? You’re getting warmer. These concepts are certainly connected. Let’s push the misconceptions aside and learn exactly what Continuous Testing is, the 10 key elements of Continuous Testing methodology, and the benefits of utilizing this concept.", "download": "/asset/download/183031", "url": "https://dzone.com/refcardz/continuous-testing-101"}, {"number": "Refcard #242", "title": "Recommendations Using Redis", "subtitle": "How to Develop a Simple Recommendations Engine Using Redis", "description": "Unlike other in-memory data stores, Redis can persist your data to a disk and accommodate a wide variety of data structures. In this Refcard, learn to develop a simple recommendation system with Redis, based on user-indicated interests and collaborative filtering. Use data structures to easily create your system, learn how to use commands, and optimize your system for real-time recommendations in production.", "download": "/asset/download/175031", "url": "https://dzone.com/refcardz/recommendations-using-redis"}, {"number": "Refcard #084", "title": "Continuous Integration", "subtitle": "Patterns and Anti-Patterns", "description": "Reap the full benefits of quality, better testing, and early error detection with proper CI implementation. This newly updated Refcard explains patterns and anti-patterns and the benefits of CI. Using specific examples from the Git Command Line Interface and Git Plugin hooks for Jenkins, it also walks through build management, build configuration, testing, and code quality.", "download": "/asset/download/169036", "url": "https://dzone.com/refcardz/continuous-integration"}, {"number": "Refcard #238", "title": "RESTful API Lifecycle Management", "subtitle": "", "description": "In this Refcard, familiarize yourself with the benefits of a managed API lifecycle and walk through specific examples of using RAML to design your API.", "download": "/asset/download/160037", "url": "https://dzone.com/refcardz/restful-api-lifecycle-management"}, {"number": "Refcard #082", "title": "Understanding Cloud Computing", "subtitle": "Amazon EC2, Google App Engine, and Microsoft Azure", "description": "This Refcard will walk you through the basics, from where exactly clouds are located, to deciphering the differences between cloud service types (IaaS, PaaS, SaaS), and the key benefits you can expect to receive.", "download": "/asset/download/154035", "url": "https://dzone.com/refcardz/getting-started-cloud"}, {"number": "Refcard #087", "title": "Continuous Integration: Servers and Tools", "subtitle": "Learning to Utilize DevOps with Servers and Tools", "description": "Follow this walkthrough of Continuous Integration that uses Hudson as an example. A must-have for all those working with CI.", "download": "/asset/download/141031", "url": "https://dzone.com/refcardz/continuous-integration-servers"}, {"number": "Refcard #003", "title": "Getting Started with Eclipse", "subtitle": "Test and Debug Code With Java’s Leading IDE", "description": "Eclipse IDE is a cross-platform, multi-purpose, open-source Integrated Development Environment. It is widely used to develop projects in Java, JavaScript, PHP, C++, Scala, and many others. This newly updated Refcard breaks down installing, setting up, and getting started with Eclipse. It also covers productivity tips, creating new projects and files, accessing Source Control Managers, and debugging configurations.", "download": "/asset/download/182035", "url": "https://dzone.com/refcardz/getting-started-eclipse"}, {"number": "Refcard #097", "title": "Getting Started With JBoss Enterprise Application Platform 7", "subtitle": "Red Hat's Expansive Development Platform", "description": "Red Hat JBoss EAP is a middleware platform built on open standards, compliant with the Java EE 7 specification. This newly updated Refcard walks you through installing JBoss EAP 7, gives an overview of the standalone vs. domain directory structure, provides administration and application deployment tutorials, and explains how JBoss EAP uses modular-based class loading.", "download": "/asset/download/115831", "url": "https://dzone.com/refcardz/getting-started-jboss"}, {"number": "Refcard #200", "title": "Java Performance Optimization", "subtitle": "Tools and Techniques for Turbocharged Apps", "description": "Getting Java apps to run is one thing. But getting them to run fast is another. Performance is a tricky beast in any object-oriented environment, but the complexity of the JVM adds a whole new level of performance-tweaking trickiness -- and opportunity. This Refcard covers JVM internals, class loading (updated to reflect the new Metaspace in Java 8), garbage collection, troubleshooting, monitoring, concurrency, and more.", "download": "/asset/download/91831", "url": "https://dzone.com/refcardz/java-performance-optimization"}, {"number": "Refcard #214", "title": "Getting Started With MQTT", "subtitle": "A Protocol for the Internet of Things", "description": "HTTP is too heavyweight for IoT devices, and request-response isn't responsive enough. Learn MQTT instead. Refcard includes message types, QoS levels, client libraries, and security.", "download": "/asset/download/83632", "url": "https://dzone.com/refcardz/getting-started-with-mqtt"}, {"number": "Refcard #076", "title": "Domain-Driven Design", "subtitle": "Object-Orientation Done Right", "description": "Developers build software to solve real-world problems. But everything from tool choice to the halting problem (to the pointy-haired boss) constrains and shapes the software you create. Learn how to make your code and your problem domain fit beautifully together.", "download": "/asset/download/77631", "url": "https://dzone.com/refcardz/getting-started-domain-driven"}, {"number": "Refcard #223", "title": "SQL Syntax for Apache Drill", "subtitle": "Using SQL for the SQL-on-Everything Engine", "description": "Acquaints you with the agility and flexibility of Apache Drill and enables you to easily query non-relational datastores, including Hadoop. Discover the benefits of data agility and gain faster insights into BI and analytics through advanced SQL queries on massive datasets.", "download": "/asset/download/68431", "url": "https://dzone.com/refcardz/sql-syntax-for-apache-drill"}, {"number": "Refcard #219", "title": "JavaFX 8", "subtitle": "The UI Toolkit for Java-Based Client Applications", "description": "Gives you what you need to start using the powerful JavaFX 8 UI and graphics tool with code snippets and visual examples of shapes and controls.", "download": "/asset/download/188031", "url": "https://dzone.com/refcardz/javafx-8-1"}, {"number": "Refcard #213", "title": "Monitoring NGINX", "subtitle": "Learn How to Monitor the Popular HTTP Server", "description": "Overcome dropped connections, server errors, and more by efficiently monitoring your NGINX web server.", "download": "/asset/download/223334", "url": "https://dzone.com/refcardz/monitoring-nginx"}, {"number": "Refcard #211", "title": "Mobile Web Application Testing", "subtitle": "Making Better Web Apps for Mobile Platforms", "description": "Covers many tools that will help to simplify the complexities of the mobile testing process, saving you time and money.", "download": "/asset/download/4", "url": "https://dzone.com/refcardz/mobile-web-application-testing"}, {"number": "Refcard #148", "title": "Mastering Portal UI", "subtitle": "Development With Vaadin and Liferay", "description": "Create gorgeous applications for your enterprise with this Refcard. For application development, Liferay Portal includes Vaadin as a pre-packaged framework for developing attractive, easy-to-use applications.", "download": "/asset/download/112", "url": "https://dzone.com/refcardz/mastering-portal-ui"}, {"number": "Refcard #195", "title": "HTML5 IndexedDB", "subtitle": "Features, Groups, Characters, and Quantifiers", "description": "Introduces you to IndexedDB by guiding you through setting up and using an IndexedDB database, and covers advanced usage and known issues.", "download": "/asset/download/131", "url": "https://dzone.com/refcardz/html5-indexeddb"}, {"number": "Refcard #190", "title": "Essential PostGIS", "subtitle": "Spatial Extender for PostgreSQL", "description": "Reviews installation, data types & administration, functions, location queries and other common tasks you perform when using PostGIS.", "download": "/asset/download/146", "url": "https://dzone.com/refcardz/essential-postgis"}, {"number": "Refcard #186", "title": "HTML5 Mobile Development", "subtitle": "Important HTML5 Mobile Technologies, Tools, Frameworks, and Communities", "description": "Covers the most important HTML5 mobile technologies and is intended to bring you up to speed in mobile HTML5 development.", "download": "/asset/download/156", "url": "https://dzone.com/refcardz/html5-mobile-development"}, {"number": "Refcard #182", "title": "Practical DNS", "subtitle": "Managing Domains for Safety, Reliability, and Speed", "description": "Introduces DNS and explains how DNS works, DNS configuration, security, and common problems, in order to get you up and running quickly, safely, and reliably.", "download": "/asset/download/162", "url": "https://dzone.com/refcardz/dns"}, {"number": "Refcard #176", "title": "Essential Couchbase APIs", "subtitle": "Open Source NoSQL Data Access from Java, Ruby, and .NET", "description": "Provides an overview of connection, storage, retrieval, update, and query operations on Couchbase databases from Java, Ruby, and .NET applications.", "download": "/asset/download/148", "url": "https://dzone.com/refcardz/couchbase-apis"}, {"number": "Refcard #172", "title": "Introduction to HTTP", "subtitle": "The Hypertext Transfer Protocol", "description": "Provides an introduction to HTTP as well as dedicated request methods, header fields and MIME types.", "download": "/asset/download/171", "url": "https://dzone.com/refcardz/http-hypertext-transfer-0"}, {"number": "Refcard #166", "title": "Patterns of Modular Architecture", "subtitle": "18 Patterns for the Java Platform", "description": "Covers 18 modularity patterns to help developers incorporate modular design thinking into development initiatives.", "download": "/asset/download/38831", "url": "https://dzone.com/refcardz/patterns-modular-architecture"}, {"number": "Refcard #162", "title": "Java Profiling with VisualVM", "subtitle": "X-Ray Vision for Dramatic Performance Gains", "description": "Describes how VisualVM can enhance the capability of monitoring and performance analysis for the Java SE platform.", "download": "/asset/download/225", "url": "https://dzone.com/refcardz/java-profiling-visualvm"}, {"number": "Refcard #158", "title": "Machine Learning", "subtitle": "Patterns for Predictive Analytics", "description": "Covers machine learning for predictive analytics, explains setting up training and testing data, and offers machine learning model snippets.", "download": "/asset/download/259", "url": "https://dzone.com/refcardz/machine-learning-predictive"}, {"number": "Refcard #154", "title": "Core Jetty", "subtitle": "A Lightweight, Open-Source Web Server and Servlet Container", "description": "Includes architecture, configuration, basic, and advanced usage, with many code examples.", "download": "/asset/download/255", "url": "https://dzone.com/refcardz/jetty"}, {"number": "Refcard #063", "title": "Getting Started with Apache Wicket", "subtitle": "Creating Standard Wicket Components", "description": "Covers how to configure the framework, define your domain model, create standard Wicket components and add internationalization options.", "download": "/asset/download/197", "url": "https://dzone.com/refcardz/getting-started-apache-wicket"}, {"number": "Refcard #150", "title": "Java Enterprise Edition 6", "subtitle": "The Most Elegant Enterprise Java Yet", "description": "Engages with the very best parts of Java EE 6's public APIs with descriptions, code examples, and class names.", "download": "/asset/download/2231", "url": "https://dzone.com/refcardz/java-enterprise-edition-6-most"}, {"number": "Refcard #144", "title": "EclipseLink JPA", "subtitle": "An Advanced ORM Persistence Framework", "description": "Build your JPA knowledge with an advanced look at the EclipseLink Framework. This Refcard focuses on EclipseLinks object to relational mapping (ORM) functionality along with its extensions of JPA 2.0.", "download": "/asset/download/101", "url": "https://dzone.com/refcardz/eclipselink-jpa"}, {"number": "Refcard #138", "title": "RichFaces 4.0", "subtitle": "A Next Generation JSF Framework", "description": "Get an in-depth introduction to this new JSF Framework. This DZone Refcard will get you started with RichFaces 4.0 and introduce the core JSF 2 extensions, render options, queue, client-side validation, rich tags, client functions, and skinning.", "download": "/asset/download/23", "url": "https://dzone.com/refcardz/richfaces-40-next-generation"}, {"number": "Refcard #135", "title": "The MVVM Design Pattern", "subtitle": "A Formula for Elegant, Maintainable Mobile Apps", "description": "Learn how to use Silverlight to create gorgeous mobiles apps for the Windows Phone. Included in this Refcard is everything from an explanation of the MVVM Design Pattern to some examples of MVVM Project Templates.", "download": "/asset/download/16", "url": "https://dzone.com/refcardz/mvvm-design-pattern-formula"}, {"number": "Refcard #065", "title": "ServiceMix 4.2", "subtitle": "The Apache Open Source ESB", "description": "Get the lowdown and the know-how on what's new with this open-source ESB.", "download": "/asset/download/190", "url": "https://dzone.com/refcardz/servicemix"}, {"number": "Refcard #127", "title": "Developing a Silverlight Application for Windows Phone", "subtitle": "Learn to Develop Silverlight Apps for Your Windows Phone", "description": "Get key information about dev tools, hardware considerations, layouts, debugging, data handling, lifecycle, and other common mobile features.", "download": "", "url": "https://dzone.com/refcardz/developing-silverlight"}, {"number": "Refcard #122", "title": "Functional Programming with Clojure", "subtitle": "Simple Concurrency on the JVM", "description": "Highlights the major improvements and new features in HTML5 and illustrates the JavaScript APIs available to work with those features.", "download": "/asset/download/104", "url": "https://dzone.com/refcardz/functional-programming-clojure"}, {"number": "Refcard #118", "title": "Getting Started with Visual Studio 2010", "subtitle": "Learn These Visual Studio 2010 Tips and Tricks", "description": "Focuses on the new features in Visual Studio 2010 and the most common keyboard shortcuts.", "download": "/asset/download/108", "url": "https://dzone.com/refcardz/getting-started-visual-studio"}, {"number": "Refcard #112", "title": "Getting Started with UML", "subtitle": "Software Design, Simplified with UML", "description": "Outlines the key elements of Unified Modeling Language (UML) to provide you with a useful reference when designing software.", "download": "/asset/download/132", "url": "https://dzone.com/refcardz/getting-started-uml"}, {"number": "Refcard #108", "title": "Getting Started Firebug 1.5", "subtitle": "The Browser IDE for Firefox", "description": "Learn to debug, edit, and monitor any website's CSS, HTML, DOM, or JavaScript with Firebug for Mozilla Firefox.", "download": "/asset/download/120", "url": "https://dzone.com/refcardz/getting-started-firebug-15"}, {"number": "Refcard #104", "title": "Getting Started with Apache Ant", "subtitle": "The TDD Build Tool for Java", "description": "Learn to automate software build processes with Apache Ant, the most widely used test-driven development build tool for Java projects.", "download": "/asset/download/8431", "url": "https://dzone.com/refcardz/getting-started-apache-ant"}, {"number": "Refcard #100", "title": "Getting Started with FitNesse", "subtitle": "Bringing Programmers and Testers Together", "description": "Learn to use Fitnesse, an open source testing framework that enables customers, testers, and programmers to easily create and edit tests.", "download": "/asset/download/161045", "url": "https://dzone.com/refcardz/getting-started-fitnesse"}, {"number": "Refcard #092", "title": "Getting Started with Silverlight and Expression Blend", "subtitle": "A Cross-Browser, Cross-Platform Plug-In For Your Browser", "description": "Learn to use Silverlight 4 and Expression Blend with a step by step guide through the development of your first application.", "download": "/asset/download/264", "url": "https://dzone.com/refcardz/getting-started-silverlight"}, {"number": "Refcard #088", "title": "Getting Started With Caucho Resin", "subtitle": "The Java EE 6 Web Profile in an App Server", "description": "Learn the basics of the Resin app server and the features of Resin 4.0. Resin comes in two flavors: Resin Open Source and Resin Professional.", "download": "/asset/download/191", "url": "https://dzone.com/refcardz/getting-started-caucho-resin"}, {"number": "Refcard #078", "title": "Getting Started with Virtualization", "subtitle": "Virtual Networking for VMware ESX and ESXi", "description": "A perfect guide for anyone new to the Virtualization space. Veteran users will be interested in the Operational Issues section.", "download": "/asset/download/247", "url": "https://dzone.com/refcardz/getting-started-virtualization"}, {"number": "Refcard #073", "title": "Getting Started With LiveCycle Data Services ES", "subtitle": "A New Way to Develop Web Apps", "description": "Introduces Adobe LiveCycle Data Services ES, a scalable web app development framework for the Flash Platform.", "download": "/asset/download/242", "url": "https://dzone.com/refcardz/getting-started-livecycle-data"}, {"number": "Refcard #068", "title": "Getting Started with Oracle Berkeley DB", "subtitle": "Transaction Support, Performance Tuning, Backup, and Recovery", "description": "Provides a brief introduction to the Oracle Berkeley DB family and discusses in depth the Oracle Berkeley DB Java Edition.", "download": "/asset/download/181", "url": "https://dzone.com/refcardz/getting-started-oracle"}, {"number": "Refcard #060", "title": "Getting Started with Grails", "subtitle": "A Full-Stack Web Application Framework", "description": "Takes you through a brief introduction of Grails, and helps you to set up your first Grails application in minutes.", "download": "/asset/download/203", "url": "https://dzone.com/refcardz/getting-started-grails"}, {"number": "Refcard #056", "title": "JavaFX", "subtitle": "Making it Easier to Build Better RIAs", "description": "Gets you started with JavaFX, which makes it easier to build better RIAs with graphics, animation, and media.", "download": "/asset/download/210", "url": "https://dzone.com/refcardz/getting-started-javafx"}, {"number": "Refcard #051", "title": "Effective Process Modeling with BPM & BPMN", "subtitle": "Empowering the BPM Lifecycle", "description": "Provides an overview of the BPM lifecycle with the roles and results of business process modeling, the BPM Notation, and the most important BPM patterns.", "download": "/asset/download/218", "url": "https://dzone.com/refcardz/bpm-bpmn"}, {"number": "Refcard #046", "title": "Core ASP.NET", "subtitle": "Elegant Web Development", "description": "Explains the most commonly used Core functions and controls in ASP.NET, a framework for the development of dynamic websites and web services.", "download": "/asset/download/233", "url": "https://dzone.com/refcardz/core-aspnet"}, {"number": "Refcard #041", "title": "SOA Governance", "subtitle": "Manage Organizations and Architecture", "description": "Provides you with an overview of the considerations, approaches, and technologies necessary for successful SOA governance.", "download": "/asset/download/216", "url": "https://dzone.com/refcardz/soa-governance"}, {"number": "Refcard #037", "title": "Getting Started with Equinox and OSGi", "subtitle": "Modular Java", "description": "Gives you a quick tour of Equinox, a highly modular, dynamic Java runtime environment, covering how it works and how to use it.", "download": "/asset/download/196", "url": "https://dzone.com/refcardz/equinox"}, {"number": "Refcard #033", "title": "Essential JSP Expression Language", "subtitle": "The Perfect JPEL Quick Reference", "description": "Gives you the essentials of the JSP Expression Language, a scripting language that can be used to evaluate dynamic expressions within a JSP page.", "download": "/asset/download/173", "url": "https://dzone.com/refcardz/essential-jsp-expression"}, {"number": "Refcard #028", "title": "JUnit and EasyMock", "subtitle": "Seamless Unit Testing and Mocking for Java", "description": "Guides you through the creation of unit tests with JUnit and EasyMock, with detailed definitions for unit testing and mock objects.", "download": "/asset/download/147", "url": "https://dzone.com/refcardz/junit-and-easymock"}, {"number": "Refcard #022", "title": "Getting Started with JPA", "subtitle": "Standardized Java ORM", "description": "Gets you started with the Java Persistence API, covering the basics of JPA and preparing you to write JPA applications.", "download": "/asset/download/130", "url": "https://dzone.com/refcardz/getting-started-with-jpa"}, {"number": "Refcard #017", "title": "Very First Steps in Flex", "subtitle": "Rapid Development of Rich Internet Applications", "description": "Gets you started with Flex, an SDK for rich Internet applications, by walking you through three projects you can begin right away.", "download": "/asset/download/107", "url": "https://dzone.com/refcardz/very-first-steps-flex"}, {"number": "Refcard #011", "title": "IntelliJ IDEA", "subtitle": "Getting Started with the High-octane IDE", "description": "Guides you towards becoming an expert at IntelliJ IDEA, and shows you how to unlock all the powerful features of this tool.", "download": "/asset/download/199233", "url": "https://dzone.com/refcardz/intellij-idea"}, {"number": "Refcard #004", "title": "Spring Configuration", "subtitle": "Dependency Injection in a Nutshell", "description": "Catalogs the XML elements available as of Spring 2.5 and highlights those most commonly used: a handy resource for Spring context configuration.", "download": "/asset/download/8", "url": "https://dzone.com/refcardz/spring-configuration"}, {"number": "Refcard #276", "title": "Responsive Web Design", "subtitle": "", "description": "The line between mobile and web development is more and more blurred, and new web apps have to adapt to any new devices or screens. In this Refcard, learn the basics of responsive design to help your app reach the most users possible.", "download": "/asset/download/260335", "url": "https://dzone.com/refcardz/responsive-web-design-8"}, {"number": "Refcard #206", "title": "Angular Essentials", "subtitle": "", "description": "This Refcard will teach you about the essential pieces of Angular and the main concepts behind working with this ever-growing platform for web-based applications through detailed diagrams, example code snippets, and in-depth explanations. You will learn about using TypeScript libraries, component classes, data binding mechanisms, and more.", "download": "/asset/download/256337", "url": "https://dzone.com/refcardz/angularjs-essentials"}, {"number": "Refcard #273", "title": "Java API Best Practices", "subtitle": "", "description": "If you want people to use your software, you're going to have to become an API developer. In this Refcard, you'll learn how to make well-documented, consistent, evolvable APIs to help your users make the most of your Java applications.", "download": "/asset/download/250336", "url": "https://dzone.com/refcardz/java-api-best-practices"}, {"number": "Refcard #160", "title": "Data Warehousing", "subtitle": "Best Practices for Collecting, Storing, and Delivering Decision-Support Data", "description": "As a total architecture, data warehousing provides decision-support data that is consistent, integrated, standard, and simply understood. From descriptions to diagrams and integration patterns, this newly updated Refcard walks you through each aspect of data warehousing. Gain a complete understanding of data modeling, infrastructure, relationships, attributes, and speedy history loading and recording with atomic data.", "download": "/asset/download/240370", "url": "https://dzone.com/refcardz/data-warehousing"}, {"number": "Refcard #129", "title": "Foundations of RESTful Architecture", "subtitle": "", "description": "The Representational State Transfer (REST) architectural style is a worldview that elevates information into a first-class element of architectures. REST allows us to achieve the architectural properties of performance, scalability, generality, simplicity, modifiability, and extensibility. This newly updated Refcard explains main HTTP verbs, describes response codes, and lists libraries and frameworks. It also gives additional resources to further explore each topic.", "download": "/asset/download/240344", "url": "https://dzone.com/refcardz/rest-foundations-restful"}, {"number": "Refcard #235", "title": "Swift Essentials", "subtitle": "Explore the essentials of this open source, type-safe, object-oriented programming language.", "description": "With its rapid development process, impressive safety and performance, and spirited open source community, Swift has quickly become the language of choice for iOS, macOS, and Linux applications. This Refcard will get you started with Swift, provides a quick reference guide for Swift syntax, and explores security and testing features in the world’s fastest growing programming language today.", "download": "/asset/download/236332", "url": "https://dzone.com/refcardz/swift-essentials"}, {"number": "Refcard #264", "title": "Blockchain and Distributed Ledger Technology for Documents", "subtitle": "", "description": "Blockchain has become well-known because of its use with Bitcoin, but there are several lesser known applications of Blockchain and Distributed Ledger Technology (DLT). This Refcard focuses on how you can use DLT and Blockchain in combination with PDFs to write applications. Learn how to reduce the complexity of your code when needing digital signing and verification functionality, assure the integrity and authenticity of a document, and automate your document-oriented workflows.", "download": "/asset/download/231336", "url": "https://dzone.com/refcardz/blockchain-and-distributed-ledger-technology-for-d"}, {"number": "Refcard #261", "title": "Improving Web Performance With Varnish", "subtitle": "", "description": "Web performance is cited by companies as one of the biggest challenges in delivering content. Varnish gives you the ability to combat this issue. Download this Refcard to get started with Varnish, learn how built-in VCL and caching rules boosts performance, and how to utilize the Varnish Configuration Language.", "download": "/asset/download/224333", "url": "https://dzone.com/refcardz/improving-web-performance-with-varnish"}, {"number": "Refcard #126", "title": "Essential Liferay", "subtitle": "A Definitive Guide for Enterprise Portal Development", "description": "Includes web content management, workflow, administration, hot tips and more.", "download": "/asset/download/216331", "url": "https://dzone.com/refcardz/essential-liferay-leading-open"}, {"number": "Refcard #255", "title": "DevOps for Database", "subtitle": "", "description": "While there has been a sharp focus and tremendous acceleration in the velocity of application software releases, updates to the underlying database have remained manual and are increasingly a bottleneck to the overall software delivery pipeline. Download this new Refcard to get started with Database Release Automation and eliminate bottlenecks. Learn the key best practices that your DevOps database solution should meet in order for you to get the most out of your investment.", "download": "/asset/download/212331", "url": "https://dzone.com/refcardz/devops-for-database"}, {"number": "Refcard #167", "title": "Software Configuration Management Patterns", "subtitle": "Improve Working and Developing Together", "description": "Covers 16 patterns that serve to increase team agility, enhanced by general guidelines for improved SCM, and a list of resources.", "download": "/asset/download/203336", "url": "https://dzone.com/refcardz/software-configuration"}, {"number": "Refcard #251", "title": "Introduction to TensorFlow", "subtitle": "", "description": "TensorFlow has a rich set of application programming interfaces for most major languages and environments needed for deep learning projects. Use cases for this open-source library include sentiment analysis, object detection in photos, and cancer detection. This Refcard will help you understand how TensorFlow works, how to install it, and how to get started with in-depth examples.", "download": "/asset/download/196143", "url": "https://dzone.com/refcardz/introduction-to-tensorflow"}, {"number": "Refcard #247", "title": "Getting Started With Spring Boot and Microservices", "subtitle": "Enhancing The Benefits Of Microservices As An Architectural Pattern", "description": "As beneficial as it is to use a microservice architectural approach, there are still downsides and obstacles to face. This Refcard will show you how to incorporate Spring Boot and Hazelcast IMDG into a microservices platform, how to enhance the benefits of the microservices landscape, and how to alleviate the drawbacks of utilizing this method.", "download": "/asset/download/187031", "url": "https://dzone.com/refcardz/getting-started-with-spring-boot-and-microservices"}, {"number": "Refcard #245", "title": "Getting Started With Redis", "subtitle": "The Open-Source Data Structure Server", "description": "Redis is an open source, in-memory data store that gives you the opportunity to store and access data quickly and efficiently. In this Refcard, you will get started on your Redis journey with a simple guide to installing and utilizing Redis, a complete glossary of data types, and the various commands to operate in Redis with detailed examples.", "download": "/asset/download/177035", "url": "https://dzone.com/refcardz/getting-started-with-redis"}, {"number": "Refcard #241", "title": "Declarative Pipeline With Jenkins", "subtitle": "A Powerful Set of Automation Tools for Jenkins", "description": "To fully recognize the benefits of Jenkins Pipeline, this Refcard will help you build a Jenkins Declarative Pipeline and manage it with Blue Ocean. Learn the details of creating a Jenkinsfile, branches and pull requests, pipeline fundamentals, and using the agent directive. In addition, understand post actions for cleaning up files, archiving results, or sending notifications; and access a complete syntax reference.", "download": "/asset/download/178032", "url": "https://dzone.com/refcardz/declarative-pipeline-with-jenkins"}, {"number": "Refcard #208", "title": "Getting Started With OpenStack", "subtitle": "The Most Popular Open-Source IaaS", "description": "Introduces OpenStack, an open source IaaS platform used to manage large pools of compute, storage, and networking resources in a data center.", "download": "/asset/download/175034", "url": "https://dzone.com/refcardz/getting-started-openstack-most"}, {"number": "Refcard #181", "title": "Using Repository Managers", "subtitle": "The Best Way to Organize, Store, and Distribute Software Components", "description": "Intended to help you design and configure a binary repository, optimize it for various workflows, and fit it smoothly into your software development lifecycle.", "download": "/asset/download/158041", "url": "https://dzone.com/refcardz/binary-repository-management"}, {"number": "Refcard #193", "title": "Core Python", "subtitle": "Creating Beautiful Code with an Interpreted, Dynamically Typed Language", "description": "Python is an interpreted, dynamically typed language. Python uses indentation to create readable, even beautiful code. With Python’s vast array of built-in libraries, it can handle many jobs without the need for further libraries, allowing you to write useful code almost immediately. But Python's extensive network of external libraries makes it easy to add functionality based on your needs.", "download": "/asset/download/154031", "url": "https://dzone.com/refcardz/core-python"}, {"number": "Refcard #099", "title": "Java EE Security Essentials", "subtitle": "Specification Level Security", "description": "The Java EE security specification supports a set of required security functionalities including authentication, authorization, data integrity, and transport security. This newly updated Refcard begins by introducing some common terms and concepts related to Java EE security such as identity stores and authentication mechanisms. We then explore authentication authorization, web module security, EJB module security, and application client security with in-depth examples.", "download": "/asset/download/136032", "url": "https://dzone.com/refcardz/getting-started-java-ee"}, {"number": "Refcard #115", "title": "Getting Started with Infinispan", "subtitle": "Enhance Performance With Scalable, Highly Available Data Stores", "description": "Infinispan is an open-source, ASL 2.0-licensed, in-memory data grid platform based on Java 8. This newly updated Refcard offers tips for implementing Infinispan, gives a practical example for using it in embedded mode, and lists key APIs and cache features. Learn more about running Infinispan in containers and how to integrate the platform with Hibernate ORM, Apache Hadoop, Apache Spark, and Apache Camel.", "download": "/asset/download/182034", "url": "https://dzone.com/refcardz/getting-started-infinispan"}, {"number": "Refcard #198", "title": "Java Enterprise Edition 7", "subtitle": "Streamlining Modern Java Development", "description": "Java Enterprise Edition allows programmers to write less and focus on delivering clean business logic. This newly updated Refcard covers the key APIs of Java EE 7 that are the most relevant to modern development - such as WebSocket, JSON Processing, Concurrency Utilities, and JAX-RS.", "download": "/asset/download/114832", "url": "https://dzone.com/refcardz/java-enterprise-edition-7"}, {"number": "Refcard #232", "title": "R Essentials", "subtitle": "The Language for Data Manipulation and Statistical Analysis", "description": "R is a highly extensible, open-source programming language used mainly for statistical analysis and graphics. R has become a widely popular language because of its varying data structures, which can be more intuitive than data storage in other languages; its built-in statistical and graphical functions; and its large collection of useful plugins that can enhance the language’s abilities in many different ways.", "download": "/asset/download/88835", "url": "https://dzone.com/refcardz/r-essentials-1"}, {"number": "Refcard #229", "title": "IoT Applications With Java and Raspberry Pi", "subtitle": "Bring Your Internet of Things Vision to Life", "description": "Covers hardware setup, Raspbian installation, and general-purpose I/O (GPIO) via two Java libraries. So where will your next project take you – a self-driving car, a portable gaming console, or...?", "download": "/asset/download/81631", "url": "https://dzone.com/refcardz/iot-applications-with-java-and-raspberry-pi"}, {"number": "Refcard #225", "title": "AMQP Essentials", "subtitle": "The Binary Transfer Protocol for Enterprise Applications and IoT", "description": "Practical introduction to AMQP — a binary, multiplexed, symmetric, secure, and lightweight message transport protocol designed for enterprise applications and particularly useful for IoT.", "download": "/asset/download/72533", "url": "https://dzone.com/refcardz/amqp-essentials"}, {"number": "Refcard #222", "title": "Getting Started With Industrial Internet", "subtitle": "The Rise of Industrial IoT", "description": "Introduces basic concepts and technologies of the Industrial Internet, including sensors and actuators, industrial control systems, human-machine interfaces, real-time streaming data, device security, and more.", "download": "/asset/download/65332", "url": "https://dzone.com/refcardz/getting-started-with-industrial-internet"}, {"number": "Refcard #218", "title": "Continuous Delivery With Jenkins Workflow", "subtitle": "The Jenkins Plugin for Managing Complex DevOps Pipelines", "description": "Provides an introduction to the Jenkins Workflow plugin, a tool that extends the popular CD application to manage even the most complex software pipelines and help you continuously deliver more efficiently.", "download": "/asset/download/44831", "url": "https://dzone.com/refcardz/continuous-delivery-with-jenkins-workflow"}, {"number": "Refcard #212", "title": "Getting Started With Apache Tomcat", "subtitle": "Learn the Tomcat Pure Java Open-Source Web Server", "description": "Learn Apache Tomcat, a pure Java open-source web server that implements the Java Servlet, JavaServer Pages, and Expression Language specifications.", "download": "/asset/download/19633", "url": "https://dzone.com/refcardz/getting-started-with-apache-tomcat"}, {"number": "Refcard #209", "title": "Distributed Machine Learning with Apache Mahout", "subtitle": "The Library for Distributed Machine Learning", "description": "Introduces Mahout, a library for scalable machine learning, and studies potential applications through two Mahout projects.", "download": "/asset/download/278", "url": "https://dzone.com/refcardz/distributed-machine-learning"}, {"number": "Refcard #199", "title": "Debugging JavaScript", "subtitle": "Picking the Right Tools for the Most Popular Programming Language", "description": "Covers common problems, debugging jQuery, mobile app debugging, useful tools, and more.", "download": "/asset/download/117", "url": "https://dzone.com/refcardz/debugging-javascript"}, {"number": "Refcard #194", "title": "Search Patterns", "subtitle": "Patterns for Integrating Cloud-Based Searches", "description": "Provides patterns for integrating cloud-based search with a variety of applications, check it out.", "download": "/asset/download/137", "url": "https://dzone.com/refcardz/search-patterns"}, {"number": "Refcard #189", "title": "Core C++", "subtitle": "The Essential Core C++ Cheat Sheet", "description": "Provides an overview of key aspects of C++, and is aimed at existing C++ programmers and object-oriented developers looking to transition to C++.", "download": "/asset/download/152", "url": "https://dzone.com/refcardz/core-cpp"}, {"number": "Refcard #185", "title": "Subversion", "subtitle": "Get Into the Subversion Source Control Repository", "description": "Intended for both version control novices and experienced developers who want to use Subversion more effectively.", "download": "/asset/download/158", "url": "https://dzone.com/refcardz/getting-started-subversion"}, {"number": "Refcard #179", "title": "Sencha Touch", "subtitle": "Open Source HTML5 Mobile Web Development Made Easy", "description": "Provides a quick reference of this application framework along with examples of the class, component, event systems, selectors, theming, and more.", "download": "/asset/download/128", "url": "https://dzone.com/refcardz/sencha-touch"}, {"number": "Refcard #175", "title": "Core Dart", "subtitle": "The Next-Generation Client-Side Web Programming Language", "description": "Covers optional typing, core types, functions, classes and interfaces in Core Dart (Google's answer to JavaScript).", "download": "/asset/download/155", "url": "https://dzone.com/refcardz/core-dart"}, {"number": "Refcard #171", "title": "MongoDB", "subtitle": "Flexible NoSQL for Humongous Data", "description": "Covers configuration options, shell functions, types of cursors, sharding and more.", "download": "/asset/download/174", "url": "https://dzone.com/refcardz/mongodb"}, {"number": "Refcard #023", "title": "PHP 5.4", "subtitle": "Scripting with PHP", "description": "Covers many important aspects of the simple, yet powerful, scripting language.", "download": "/asset/download/257", "url": "https://dzone.com/refcardz/php-54-scalable"}, {"number": "Refcard #161", "title": "Jenkins on PaaS", "subtitle": "Continuous Integration with Jenkins for Java Projects", "description": "Includes a review of the most useful plugins, best practices, security, integration to an enterprise environment, and more.", "download": "/asset/download/230", "url": "https://dzone.com/refcardz/jenkins-paas"}, {"number": "Refcard #157", "title": "Database Partitioning with MySQL", "subtitle": "Improving Performance, Availability, and Manageability", "description": "Provides an overview of the MySQL database partitioning techniques and how these techniques lead to operational excellence.", "download": "/asset/download/258", "url": "https://dzone.com/refcardz/database-partitioning"}, {"number": "Refcard #152", "title": "HTML5 WebSocket", "subtitle": "Full-Duplex, Real-Time Web Communication", "description": "Includes technical details of the WebSocket protocol, sample API usage, fallbacks for older browsers, and more.", "download": "/asset/download/253", "url": "https://dzone.com/refcardz/html5-websocket"}, {"number": "Refcard #005", "title": "Windows PowerShell", "subtitle": "A Powerful Windows Shell and Scripting Language", "description": "Introduces Windows PowerShell, an object-based command shell and scripting language designed for Microsoft Windows.", "download": "/asset/download/271", "url": "https://dzone.com/refcardz/windows-powershell"}, {"number": "Refcard #149", "title": "Chef An Open Source Tool for Scalable Cloud and Data Center Automation", "subtitle": "An Open Source Tool for Scalable Cloud and Data Center Automation", "description": "Get the ultimate cheat sheet for a new breed of open-source infrastructure. You’ll learn how to create a Chef cookbook, and you’ll learn about Run Lists, “Knife,” and the 0hai Ruby library.", "download": "/asset/download/32", "url": "https://dzone.com/refcardz/chef-open-source-tool-scalable"}, {"number": "Refcard #143", "title": "ColdFusion Builder 2", "subtitle": "Faster Coding, Less Errors", "description": "Check out the improvements Adobe made to its popular Builder 1. This DZone Refcard will take you through installation and starting a new project, to server connections, views, and search.", "download": "/asset/download/31", "url": "https://dzone.com/refcardz/coldfusion-builder-2-faster"}, {"number": "Refcard #080", "title": "Essential NetBeans Platform", "subtitle": "Learn this Swing Framework for Your Applications", "description": "Get started with developing your very own robust and extensible applications", "download": "/asset/download/236", "url": "https://dzone.com/refcardz/netbeans-platform-70"}, {"number": "Refcard #134", "title": "Cloud Computing with Windows Azure Platform", "subtitle": "Configure and Compute in the Cloud", "description": "Get familiar with the Windows Azure cloud service configurations, storage allocations to compute instances, and Windows Azure AppFabric.", "download": "/asset/download/277", "url": "https://dzone.com/refcardz/cloud-computing-windows-azure"}, {"number": "Refcard #131", "title": "ADO.NET Entity Framework", "subtitle": "Object-Relational Mapping and Data Access", "description": "Become an expert at developing ADO.NET framework. This DZone Refcard will give you a major advantage when developing the data architecture for your .NET applications.", "download": "/asset/download/5", "url": "https://dzone.com/refcardz/adonet-entity-framework-object"}, {"number": "Refcard #125", "title": "Selenium 2.0: Using the Webdriver API to Create Robust User Acceptance Tests", "subtitle": "Automate User Acceptance Tests With Selenium 2.0", "description": "Covers the background of Selenium 2.0, WebDriver architecture, installation, driver implementation, page interaction models and mobile support.", "download": "/asset/download/102", "url": "https://dzone.com/refcardz/getting-started-selenium-20"}, {"number": "Refcard #121", "title": "Open Source Media Framework", "subtitle": "Building Simple Custom Video Players", "description": "Learn about Strobe Media Playback, Flash Media, key events, streaming, composite elements, and more.", "download": "/asset/download/110", "url": "https://dzone.com/refcardz/getting-started-web-video"}, {"number": "Refcard #116", "title": "Adobe ColdFusion Web Services for PHP Programmers", "subtitle": "Making Web Apps the Easy Way", "description": "Details how to access and discover exposed web services and services from PHP, generate documents and charts, and manipulate PDFs and images.", "download": "/asset/download/125", "url": "https://dzone.com/refcardz/adobe-coldfusion-web-services-0"}, {"number": "Refcard #111", "title": "Getting Started with Windows Communication Foundation 4.0", "subtitle": "The Standard in .NET Messaging", "description": "Gets you up to speed with WCF and covers configuration, contracts, bindings, behaviors, hosted services, diagnostics, and consuming services.", "download": "/asset/download/134", "url": "https://dzone.com/refcardz/getting-started-windows-0"}, {"number": "Refcard #107", "title": "Getting Started With Griffon", "subtitle": "Groovy Apps on the Desktop", "description": "Develop rich desktop applications with Griffon, a Grails-like app built on Groovy, Java, and Swing that automates many common tasks.", "download": "/asset/download/135", "url": "https://dzone.com/refcardz/getting-started-griffon"}, {"number": "Refcard #103", "title": "Leveraging ColdFusion 9 Exposed Services from Java", "subtitle": "CF-as-a-Service From Java", "description": "Expand your knowledge of ColdFusion with Exposed Services to unlock capabilities that other languages and technologies can take advantage of.", "download": "/asset/download/185", "url": "https://dzone.com/refcardz/leveraging-coldfusion-9"}, {"number": "Refcard #098", "title": "Getting Started with Maven Repository Management", "subtitle": "The Ultimate Solution for Codebase Management", "description": "Begin learning about Maven Repository Management, covering proxy repositories, hosted repositories, and repository groups.", "download": "/asset/download/223", "url": "https://dzone.com/refcardz/getting-started-repository"}, {"number": "Refcard #091", "title": "Getting Started With Adobe Flash Builder 4", "subtitle": "An IDE for ActionScript and Flex Development", "description": "How to use Flash Builder to develop Flex applications, including creating projects, developing, building, testing, and debugging flex apps.", "download": "/asset/download/266", "url": "https://dzone.com/refcardz/getting-started-adobe-flash"}, {"number": "Refcard #086", "title": "Spring Web Flow", "subtitle": "The Essential SWF Cheat Sheet", "description": "See how to add Spring Web Flow to a Spring application and define flows that initiate conversations between the application and its users.", "download": "/asset/download/198", "url": "https://dzone.com/refcardz/spring-web-flow"}, {"number": "Refcard #077", "title": "Core WS-BPEL: Business Process Execution Language", "subtitle": "Business Process Execution Language", "description": "Covers WS-BPEL 2.0, its process structure, standard faults, default attribute values, and all important BPEL activities.", "download": "/asset/download/246", "url": "https://dzone.com/refcardz/core-ws-bpel-business-process"}, {"number": "Refcard #072", "title": "Getting Started with Windows Presentation Foundation", "subtitle": "Learn to Master WPF", "description": "Helps you understand the basics of WPF, ranging from XAML and Markup Extensions to Panels and Data Binding.", "download": "/asset/download/241", "url": "https://dzone.com/refcardz/getting-started-windows"}, {"number": "Refcard #066", "title": "Getting Started With ColdFusion 9", "subtitle": "A Rapid Application Development Toolkit", "description": "Great start sheet that lists various ways of communicating with databases, other tools, services and languages.", "download": "/asset/download/188", "url": "https://dzone.com/refcardz/getting-started-coldfusion-9"}, {"number": "Refcard #059", "title": "Getting Started with Drupal 7", "subtitle": "Managing Content, Modules, and Themes", "description": "Introduces Drupal 7, including a discussion of Drupal pages, from types to content nodes, and instructions for installation.", "download": "/asset/download/204", "url": "https://dzone.com/refcardz/getting-started-drupal"}, {"number": "Refcard #055", "title": "Apache Maven 2", "subtitle": "Enabling You to Build Better Java Code", "description": "Gives Java developers a wide range of execution commands, tips for debugging Mavenized builds, and a clear introduction to the Maven vocabulary.", "download": "/asset/download/212", "url": "https://dzone.com/refcardz/apache-maven-2"}, {"number": "Refcard #049", "title": "Getting Started with BIRT", "subtitle": "Eclipse-Based BI and Big Data Visualization", "description": "Provides an overview of the BIRT 3.7 components, focusing on a few key capabilities of the BIRT Designer, BIRT Runtime APIs, and BIRT Web Viewer.", "download": "/asset/download/227", "url": "https://dzone.com/refcardz/birt"}, {"number": "Refcard #045", "title": "Agile Adoption: Decreasing Time to Market", "subtitle": "Find the Right Agile Practices for Your Team", "description": "Helps you find the right Agile practices for your team or organization when getting to market faster is of prime importance.", "download": "/asset/download/226", "url": "https://dzone.com/refcardz/agile-adoption-decreasing-time"}, {"number": "Refcard #040", "title": "Apache Tapestry 5.0", "subtitle": "Convention Over Configuration for Java Web Apps", "description": "Reviews the structure of Tapestry applications, the format of Tapestry markup templates, standard components, and typical configuration options.", "download": "/asset/download/207", "url": "https://dzone.com/refcardz/apache-tapestry-50"}, {"number": "Refcard #038", "title": "SOA Patterns", "subtitle": "Service-Orient Your Enterprise", "description": "Covers SOA Patterns and includes Pattern names, Icons, Summaries, Problems, Solutions, Applications, Diagrams, Results, and Examples.", "download": "/asset/download/178", "url": "https://dzone.com/refcardz/soa-patterns"}, {"number": "Refcard #31", "title": "Core Seam", "subtitle": "Seam in Practice", "description": "Covers commonly used annotations and XML elements as of Seam 2.1. and points you to examples of how the configuration options can be used in practice.", "download": "/asset/download/167", "url": "https://dzone.com/refcardz/core-seam"}, {"number": "Refcard #026", "title": "Spring Annotations", "subtitle": "Become a Spring Guru", "description": "Guides you through all annotations supported in Spring 2.5, covering Core Spring Annotations, Spring MVC Annotations, and more.", "download": "/asset/download/150", "url": "https://dzone.com/refcardz/spring-annotations"}, {"number": "Refcard #021", "title": "JavaServer Faces", "subtitle": "Easy Web Development in Java", "description": "Describes the JSF development process, standard JSF tags, the JSF expression language, and the faces-config.xml configuration file.", "download": "/asset/download/133", "url": "https://dzone.com/refcardz/javaserver-faces"}, {"number": "Refcard #014", "title": "NetBeans IDE 7 Java Editor", "subtitle": "A Well-Aligned JDK 7 Development Experience", "description": "Get as much out of JDK 7 and NetBeans IDE 7 as their creators intended.", "download": "/asset/download/42", "url": "https://dzone.com/refcardz/netbeans"}, {"number": "Refcard #010", "title": "Silverlight 2", "subtitle": "Microsoft's RIA Platform", "description": "Introduces Silverlight, Microsoft’s offering for designing, developing, and delivering rich interactive applications over the Internet.", "download": "/asset/download/19", "url": "https://dzone.com/refcardz/silverlight2"}, {"number": "Refcard #002", "title": "Getting Started with Ajax", "subtitle": "Unlocking Unobtrusive JavaScript", "description": "Introduces Ajax, a group interrelated techniques used in client-side web development for creating asynchronous web applications.", "download": "/asset/download/11", "url": "https://dzone.com/refcardz/getting-started-ajax"}, {"number": "Refcard #145", "title": "Continuous Delivery", "subtitle": "Patterns and Anti-Patterns in the Software Lifecycle", "description": "Minimize the time it takes to go from idea to usable software. Learn to use agile techniques and automate the entire software delivery system: build, deploy, test, release.", "download": "/asset/download/263337", "url": "https://dzone.com/refcardz/continuous-delivery-patterns"}, {"number": "Refcard #274", "title": "Temporal Data Processing", "subtitle": "", "description": "Download this Refcard to learn how to handle data that varies over time in relational databases using temporal tables.", "download": "/asset/download/263339", "url": "https://dzone.com/refcardz/temporal-data-processing"}, {"number": "Refcard #260", "title": "REST API Security", "subtitle": "", "description": "API security is the single biggest challenge organizations want to see solved in the years ahead. Download this Refcard to gain a better understanding of REST APIs, authentication types, and other aspects of security.", "download": "/asset/download/242331", "url": "https://dzone.com/refcardz/rest-api-security-1"}, {"number": "Refcard #268", "title": "Cloud Capacity Management", "subtitle": "", "description": "With the increasing use of cloud environments in IT, it’s key to ensure you’re managing and optimizing your cloud resources as you would with on-premise resources. This Refcard dives into what it means to extend capacity management to the cloud, how it differs from traditional on-premises capacity management, and how to apply it in specific use cases.", "download": "/asset/download/240331", "url": "https://dzone.com/refcardz/cloud-capacity-management"}, {"number": "Refcard #266", "title": "Agile Patterns", "subtitle": "", "description": "Many companies struggle with maintaining an agile approach that will bring practical process control to complex and uncertain environments. This Refcard focuses on recurring patterns you can follow to ensure that an agile enterprise can be built that will ultimately make an imprint upon organizational culture. Dive in to discover effective agile patterns and best practices to begin your agile transformation.", "download": "/asset/download/235335", "url": "https://dzone.com/refcardz/agile-patterns"}, {"number": "Refcard #117", "title": "Getting Started With Apache Hadoop", "subtitle": "Learn the Basics of the Hadoop Framework", "description": "Lately, it has become expensive and otherwise impossible for companies to store their data in one system and to analyze it with traditional solutions. Download this Refcard to learn how Apache Hadoop stores and processes large datasets, get a breakdown of the core components of Hadoop, and learn the most popular frameworks for processing data on Hadoop.", "download": "/asset/download/231353", "url": "https://dzone.com/refcardz/getting-started-apache-hadoop"}, {"number": "Refcard #204", "title": "Apache Spark", "subtitle": "An Engine for Large-Scale Data Processing", "description": "Introduces Spark, explains its place in big data, walks through setup and creation of a Spark application, and explains commonly used actions and operations.", "download": "/asset/download/223335", "url": "https://dzone.com/refcardz/apache-spark"}, {"number": "Refcard #258", "title": "Docker Security", "subtitle": "", "description": "This Refcard will lay out the basics of the container security challenge, give you hands-on experience with basic security options, and also spell out some more advanced workflows. We split container security into three sections covering what to do at each step of your container security lifecycle.", "download": "/asset/download/214336", "url": "https://dzone.com/refcardz/docker-security"}, {"number": "Refcard #061", "title": "Core Java Concurrency", "subtitle": "Understanding the Core Concurrency Concepts", "description": "This Refcard will help Java developers working with multi-threaded programs to understand core concurrency concepts and how to apply them. Overview the key aspects of the Java language and get references on the core library.", "download": "/asset/download/210335", "url": "https://dzone.com/refcardz/core-java-concurrency"}, {"number": "Refcard #164", "title": "Getting Started With Scala", "subtitle": "A General-Purpose Programming Language", "description": "Covers creating a new Scala project, a tour of Scala's features, an introduction to classes and objects within Scala, and much more.", "download": "/asset/download/203331", "url": "https://dzone.com/refcardz/scala"}, {"number": "Refcard #250", "title": "Getting Started With Memcached", "subtitle": "A high-performance, distributed memory object caching solution.", "description": "This new Refcard provides you with basic configuration information for servers and client-side commands to use memcached as a caching solution for your applications. Begin your installation, learn useful commands, and see what tools are available to help monitor and troubleshoot.", "download": "/asset/download/195131", "url": "https://dzone.com/refcardz/getting-started-with-memcached"}, {"number": "Refcard #210", "title": "NoSQL and Data Scalability", "subtitle": "Keeping Up With the World of Non-Relational Databases", "description": "NoSQL databases offer superior performance and scalability and handle several tasks that the relational model is not able to manage. This Refcard covers the range of NoSQL database types available today, whether NoSQL is right for you, and several real-life use cases for using a NoSQL database.", "download": "/asset/download/188038", "url": "https://dzone.com/refcardz/nosql-and-data-scalability-20"}, {"number": "Refcard #244", "title": "Getting to Know Google Compute Engine and How to Use It", "subtitle": "Google’s Virtual Machine Offering", "description": "Google Compute Engine is Google's Infrastructure-as-a-Service (IaaS) virtual machine offering. It allows customers to use powerful virtual machines in the Cloud as server resources instead of acquiring and managing server hardware. This Refcard serves as an introduction to the Compute Engine and explores its main features. Learn more about machine types, instance groups, and ways to interact with Compute Engine.", "download": "/asset/download/177033", "url": "https://dzone.com/refcardz/getting-to-know-google-compute-engine-and-how-to-u"}, {"number": "Refcard #043", "title": "Scalability & High Availability", "subtitle": "Performing Well at Any Scale", "description": "Provides the tools to define Scalability and High Availability, so your team can implement critical systems with well-understood performance goals.", "download": "/asset/download/169039", "url": "https://dzone.com/refcardz/scalability"}, {"number": "Refcard #094", "title": "Getting Started with Git", "subtitle": "The De Facto Standard For Version Control", "description": "This updated Refcard explains why so many developers are migrating to this exciting platform. Learn about creating a new Git repository, cloning existing projects, the remote workflow, and more to pave the way for limitless content version control.", "download": "/asset/download/162031", "url": "https://dzone.com/refcardz/getting-started-git"}, {"number": "Refcard #201", "title": "Reactive Programming with Akka", "subtitle": "Event-Driven, Scalable, Resilient, and Responsive Java and Scala", "description": "Dives into Akka, covering defining and creating actors and messages, actor hierarchies, fault-tolerance and self-healing, and more.", "download": "/asset/download/156038", "url": "https://dzone.com/refcardz/reactive-programming-akka"}, {"number": "Refcard #050", "title": "Scrum", "subtitle": "The Most Popular Agile Methodology", "description": "Scrum is a framework that allows people to productively and creatively deliver products of the highest possible value. With over 70% of Agile teams using Scrum or Scrum hybrid, learn more about its benefits in managing complex product development. This newly updated Refcard explores the details of Scrum, including theory, values, roles, and events. It also includes a sample of a popular approach to deliver Integrated Increments in a scaled environment.", "download": "/asset/download/145041", "url": "https://dzone.com/refcardz/scrum"}, {"number": "Refcard #083", "title": "Contexts and Dependency Injection for the Java EE Platform", "subtitle": "Understanding CDI", "description": "Java EE 6 introduced Contexts and Dependency Injections (CDI) as a set of component management services that allow for loose coupling of components across layers (through dependency injection) in a type-safe way. The benefits of CDI include a simplified architecture and more reusable code. In this newly updated Refcard, you will learn about the main features of CDI 1.2 in Java EE 7, how to get the most from CDI, and how to get your CDI code up and running.", "download": "/asset/download/130031", "url": "https://dzone.com/refcardz/contexts-and-depencency"}, {"number": "Refcard #170", "title": "Camel Essential Components", "subtitle": "Simplify Service Integrations With Intelligent Routing", "description": "Apache Camel is an open-source, lightweight integration library that allows your applications to accomplish intelligent routing, message transformation, and protocol mediation. This newly updated Refcard introduces Apache Camel, explains its benefits, and demonstrates essential components. Gain a deeper understanding of implementing JMS and ActiveMQ, the Bean Component, Log and Metrics Components, and Camel's REST DSL.", "download": "/asset/download/118831", "url": "https://dzone.com/refcardz/essential-camel-components"}, {"number": "Refcard #067", "title": "Getting Started With Selenium", "subtitle": "A Portable Software Testing Framework for Web Applications", "description": "Covers the latest updates to Selenium and gives you the tools you need to launch Selenium on any major browser, on any major operating system.", "download": "/asset/download/222341", "url": "https://dzone.com/refcardz/getting-started-selenium"}, {"number": "Refcard #231", "title": "From Relational to Graph: A Developer's Guide", "subtitle": "Your Guide to Moving From RDBMS to Neo4j's Open-Source, NoSQL Graph Database", "description": "We live in a connected world, and representing connected data shouldn’t feel odd. Enter the graph database: a flexible and expressive model that ditches table-based schemae in favor of a more natural approach that treats connections as first-class citizens. In this Refcard, developers familiar with relational databases will get an introduction to the wonderful world of graph databases with working examples in Neo4j.", "download": "/asset/download/89831", "url": "https://dzone.com/refcardz/from-relational-to-graph-a-developers-guide"}, {"number": "Refcard #228", "title": "Getting Started With Apache JMeter", "subtitle": "Your Open-Source, Pure Java Solution for Load Testing", "description": "Pragmatic introduction to the open-source, wildly popular, easily extensible load testing framework. Learn how to build a test plan, follow a typical testing workflow, and interpret results.", "download": "/asset/download/79632", "url": "https://dzone.com/refcardz/getting-started-with-apache-jmeter"}, {"number": "Refcard #018", "title": "Core .NET", "subtitle": "Your Go-To .NET Desk Reference", "description": "Snapshot of the modern .NET Framework from 30,000 feet, plus deep dive into .NET types, portable class libraries, encodings, and asynchronous programming.", "download": "/asset/download/72431", "url": "https://dzone.com/refcardz/coredotnet"}, {"number": "Refcard #220", "title": "Getting Started With Real User Monitoring", "subtitle": "Monitor Website Performance Based on Real User Data", "description": "Teaches you how to use new web standards—like W3C’s Beacon API—to see how your site is performing for actual users, letting you better understand how to improve overall user experience.", "download": "/asset/download/56034", "url": "https://dzone.com/refcardz/getting-started-with-real-user-monitoring"}, {"number": "Refcard #217", "title": "Functional Programming in JavaScript", "subtitle": "The Functional Paradigm in a Familiar Language", "description": "Explains functions, data types, and techniques to demonstrate the functional paradigm through the familiar JavaScript language.", "download": "/asset/download/42836", "url": "https://dzone.com/refcardz/functional-programming-with-javascript"}, {"number": "Refcard #052", "title": "IntelliJ IDEA Essentials", "subtitle": "Your Guide to the Most Intelligent Java IDE", "description": "Helps Java developers navigate the various facets of this world-class IDE, with tips, tricks, shortcuts, and quick tutorials on editor basics, navigation, and more.", "download": "/asset/download/16631", "url": "https://dzone.com/refcardz/intellij-idea-update"}, {"number": "Refcard #205", "title": "PHP 5.5 & 5.6", "subtitle": "What's New in PHP", "description": "Covers new improvements and platform enhancements in the 5.5 and 5.6 releases of this server-side scripting language.", "download": "/asset/download/33", "url": "https://dzone.com/refcardz/whats-new-php-55-56"}, {"number": "Refcard #197", "title": "Spring Integration", "subtitle": "Core Components of the Leading Java Framework", "description": "Covers core components, messaging channels, message routing and transformation of this Java- based framework.", "download": "/asset/download/124", "url": "https://dzone.com/refcardz/spring-integration"}, {"number": "Refcard #192", "title": "CSS3 Basics", "subtitle": "New Features for Super-Powered Web Development", "description": "Covers the most important features introduced or updated in CSS3, including new selectors, color styles, font, text styles and background styles.", "download": "/asset/download/143", "url": "https://dzone.com/refcardz/css3"}, {"number": "Refcard #188", "title": "Business Rule Management With Drools", "subtitle": "An IDE for ActionScript and Flex Development", "description": "Introduces Drools, a rules engine for Java and .NET. Aimed at experienced developers who are new to Business Rule Management Systems (BRMS).", "download": "/asset/download/151", "url": "https://dzone.com/refcardz/drools"}, {"number": "Refcard #184", "title": "Core Spring Data", "subtitle": "A Must-Have Reference for the Spring Data Project", "description": "Covers support modules for traditional, NoSQL, and big data technologies and provides a consistent Spring-based programming model across database technologies.", "download": "/asset/download/159", "url": "https://dzone.com/refcardz/core-spring-data"}, {"number": "Refcard #178", "title": "Git Patterns and Anti-Patterns", "subtitle": "Scaling from Workgroup to Enterprise", "description": "Suggests patterns and anti-patterns, including Hybrid SCM, Git champions, blessed repository, per-feature topic branches, and ALM integration.", "download": "/asset/download/140", "url": "https://dzone.com/refcardz/git-patterns-and-anti-patterns"}, {"number": "Refcard #174", "title": "Object-Oriented JavaScript", "subtitle": "Advanced Techniques for Serious Web Applications", "description": "Covers advanced object-oriented techniques in JavaScript, including object creation, member scoping, namespaces, inheritance and modularization.", "download": "/asset/download/160", "url": "https://dzone.com/refcardz/object-oriented-javascript"}, {"number": "Refcard #169", "title": "Essential Apache HTTP Server", "subtitle": "Configure and Administer the World's Most Popular Web Server", "description": "Shows how to configure and administer the Apache HTTP server (versions 2.2 and 2.4)", "download": "/asset/download/172", "url": "https://dzone.com/refcardz/essential-apache-http-server"}, {"number": "Refcard #165", "title": "Deployment Automation Patterns", "subtitle": "Solutions to Common Software Deployment Issues", "description": "Covers seven useful deployment automation patterns, antipatterns and code snippets.", "download": "/asset/download/195", "url": "https://dzone.com/refcardz/deployment-automation-patterns"}, {"number": "Refcard #140", "title": "Mule 3.3", "subtitle": "Simplifying SOA", "description": "Learn how to deply on this SOA. If you are a new user, it will serve as a handy reference when building your integration flows in Mule. If you are an existing user, especially of Mule 2, it will help ease your transition into using Mule 3.", "download": "/asset/download/27", "url": "https://dzone.com/refcardz/essential-mule-3-3"}, {"number": "Refcard #156", "title": "Java FX", "subtitle": "A Rich Client Platform for Java", "description": "Includes writing JavaFX applications and also serves as a convenient reference to some of the more advanced APIs in JavaFX 2.0.", "download": "/asset/download/265", "url": "https://dzone.com/refcardz/javafx-20-rich-client-platform"}, {"number": "Refcard #151", "title": "HTML5 Canvas", "subtitle": "A Web Standard for Dynamic Graphics", "description": "Check out the standard for dynamic graphics in HTML5 Canvas", "download": "/asset/download/251", "url": "https://dzone.com/refcardz/html5-canvas-web-standard"}, {"number": "Refcard #007", "title": "jQuery Selectors", "subtitle": "The Core jQuery Reference", "description": "Introduces jQuery Selectors, which allow you to select and manipulate HTML elements as a group or as a single element in jQuery.", "download": "/asset/download/270", "url": "https://dzone.com/refcardz/jquery-selectors"}, {"number": "Refcard #147", "title": "Eclipse Tools for Spring", "subtitle": "The SpringSource Tool Suite", "description": "Get to know all of Spring's out-of-the-box developer tools for Eclipse. This Refcard will walk you through installation, configuration, validation, Bean navigation, Spring Aspect Oriented Programming, and analysis.", "download": "/asset/download/36", "url": "https://dzone.com/refcardz/eclipse-tools-spring"}, {"number": "Refcard #142", "title": "Adobe Flash Builder 4.5", "subtitle": "Develop for the Web, Desktop, and Mobile", "description": "Reap the benefits of Flash Builder 4.5 to develop Flex applications and deploy them on web, desktop or mobile platforms.", "download": "/asset/download/276", "url": "https://dzone.com/refcardz/adobe-flash-builder-45-develop"}, {"number": "Refcard #137", "title": "Understanding Lucene", "subtitle": "Powering Better Search Results", "description": "Learn to use the powerful multi-language search engine from Lucene. This Refcard will give you a foundational knowledge of Lucenes features from the inverted index structure on up.", "download": "/asset/download/21", "url": "https://dzone.com/refcardz/lucene"}, {"number": "Refcard #133", "title": "Apache Hadoop Deployment", "subtitle": "A Blueprint for Reliable Distributed Computing", "description": "Learn how to use one of the most popular open source data projects out there. This Refcard reviews a basic blueprint for deploying Apache Hadoop HDFS and MapReduce using the Cloudera Distribution.", "download": "/asset/download/9", "url": "https://dzone.com/refcardz/deploying-hadoop"}, {"number": "Refcard #130", "title": "Designing Quality Software", "subtitle": "Architectural and Technical Best Practices", "description": "Provides a comprehensive list of design rules, programming rules, testing rules, environment rules, and common sense rules to build better software.", "download": "/asset/download/3", "url": "https://dzone.com/refcardz/designing-quality-software"}, {"number": "Refcard #124", "title": "PHPUnit: PHP Test-Driven Development Automated Tools to Improve Your PHP Code Quality", "subtitle": "Clean Up Your Code Quality with PHPUnit", "description": "Shows you how to set up and automate your testing with ease and help you improve code quality.", "download": "/asset/download/105", "url": "https://dzone.com/refcardz/phpunit-php-test-driven"}, {"number": "Refcard #120", "title": "Apache Solr: Getting Optimal Search Results", "subtitle": "Optimize Your Search Results With Apache Solr", "description": "Learn about searching, solrconfig.xml, schema.xml, field types, analyzers, indexing, and advanced search features.", "download": "/asset/download/115", "url": "https://dzone.com/refcardz/solr-essentials"}, {"number": "Refcard #114", "title": "Application Prototyping with SketchFlow", "subtitle": "Application Prototyping Explained", "description": "Cover the core aspects, practical guidelines and principles that are key to SketchFlow Application Prototyping.", "download": "/asset/download/122", "url": "https://dzone.com/refcardz/application-prototyping"}, {"number": "Refcard #110", "title": "Objective-C for the iPhone and iPad", "subtitle": "The Basics of Objective-C", "description": "Develop apps for Apple's Mac OS X and iOS with Objective-C. This Refcard covers class declaration, memory management, Xcode, debugging, and more.", "download": "/asset/download/138", "url": "https://dzone.com/refcardz/objective-c-iphone-and-ipad"}, {"number": "Refcard #106", "title": "Expression-Based Authorization with Spring Security 3", "subtitle": "Baking Security Into Enterprise Apps", "description": "Begin to master Spring Security by learning the key features of expression-based authorization for a challenging framework.", "download": "/asset/download/57132", "url": "https://dzone.com/refcardz/expression-based-authorization"}, {"number": "Refcard #102", "title": "Flex 4 & Spring 3 Integration", "subtitle": "Harnessing Flash and Java Together", "description": "Use Flex Remoting and Messaging to connect to Spring and Hibernate. Also included is a section on how to use Spring Security with Flex.", "download": "/asset/download/194", "url": "https://dzone.com/refcardz/flex-4-and-spring-3"}, {"number": "Refcard #096", "title": "Getting Started With Integrating PHP and Flex", "subtitle": "Adobe/Zend Tools for the PHP Professional", "description": "Developed by Adobe and Zend Technologies, Flash Builder 4.5 improves Flash Builder 4 to help PHP developers get the most out of their apps.", "download": "/asset/download/224", "url": "https://dzone.com/refcardz/getting-started-php-and-flex"}, {"number": "Refcard #090", "title": "Getting Started With Adobe ColdFusion Builder", "subtitle": "Delivering Truly Rapid Application Development", "description": "Learn to install the Eclipse-based Adobe ColdFusion Builder IDE and build a ColdFusion project while reviewing the IDE's features.", "download": "/asset/download/268", "url": "https://dzone.com/refcardz/getting-started-adobe"}, {"number": "Refcard #081", "title": "Essential F#", "subtitle": "The Best Parts of F#", "description": "Learn to use this .NET programming language with both functional and object-oriented features to create some mind-bending code.", "download": "/asset/download/237", "url": "https://dzone.com/refcardz/essential-f"}, {"number": "Refcard #075", "title": "Getting Started with BlazeDS", "subtitle": "Integrating Adobe Flex and Java", "description": "Learn about Adobe's tool for coupling together Flash platform-based interfaces with robust Java enterprise servers.", "download": "/asset/download/244", "url": "https://dzone.com/refcardz/getting-started-blazeds"}, {"number": "Refcard #070", "title": "Eclipse Plug-in Development", "subtitle": "Customize and Enhance Your Eclipse Experience", "description": "Explains to the reader the process of Eclipse-based plug-in development, from plug-in basics to the OSGi manifest, the plug-in manifest and hot tips.", "download": "/asset/download/239", "url": "https://dzone.com/refcardz/eclipse-plug-development"}, {"number": "Refcard #064", "title": "Core HTML", "subtitle": "The Foundation of All Web Development", "description": "Introduces the basics of HTML and XHTML, Page Structure Elements, Key Structural Elements, Specialty Markup and Validation. Great for beginners and veterans alike.", "download": "/asset/download/192", "url": "https://dzone.com/refcardz/core-html"}, {"number": "Refcard #058", "title": "JavaServer Faces 2.0", "subtitle": "The JSF Expression Language", "description": "Provides summaries of the tags and attributes needed for JSF programming, a summary of the JSF expression language, and a list of code snippets for common operations.", "download": "/asset/download/205", "url": "https://dzone.com/refcardz/javaserver-faces-20"}, {"number": "Refcard #054", "title": "Agile Adoption: Reducing Cost", "subtitle": "Building the System for Less", "description": "Helps you build software faster, better, and cheaper, and teaches you four practical strategies for reducing the cost of software development.", "download": "/asset/download/214", "url": "https://dzone.com/refcardz/agile-adoption-reducing-cost"}, {"number": "Refcard #048", "title": "Flex & Spring Integration", "subtitle": "Combining Flash and Java Technologies", "description": "Shows you how to integrate Flex and Spring to create a powerful platform for building robust Rich Internet Applications.", "download": "/asset/download/229", "url": "https://dzone.com/refcardz/flex-spring-integration"}, {"number": "Refcard #044", "title": "JBoss RichFaces", "subtitle": "Ajax Meets Java", "description": "Introduces JBoss RichFaces, a JSF component library consisting of two main parts: Ajax enabled JSF components and the Component Development Kit.", "download": "/asset/download/219", "url": "https://dzone.com/refcardz/richfaces"}, {"number": "Refcard #039", "title": "Essential EMF", "subtitle": "An Eclipse Standard for Data Models", "description": "Gets you started with the Eclipse Modeling Framework, including a quick start to generating a model, regeneration and merging, and more.", "download": "/asset/download/209", "url": "https://dzone.com/refcardz/essential-emf"}, {"number": "Refcard #035", "title": "Using XML in Java", "subtitle": "A Pro's Guide to XML Processing Technology", "description": "Provides developers a concise overview of the different XML processing technologies in Java, and a use case of each technology.", "download": "/asset/download/183", "url": "https://dzone.com/refcardz/using-xml-java"}, {"number": "Refcard #030", "title": "Essential Ruby", "subtitle": "The Perfect Ruby Quick Reference", "description": "Provides a quick reference to the Ruby language, including language elements and many important API functions for quick look-up.", "download": "/asset/download/153", "url": "https://dzone.com/refcardz/essential-ruby"}, {"number": "Refcard #025", "title": "Core CSS: Part II", "subtitle": "Understanding Selectors", "description": "Covers Core principles of CSS that will expand and strengthen your professional ability to work with CSS. Part two of three.", "download": "/asset/download/136", "url": "https://dzone.com/refcardz/corecss2"}, {"number": "Refcard #020", "title": "Struts2", "subtitle": "The Sturdy JEE Web Framework", "description": "Explains the configuration elements to make the most of Struts2, an application framework for developing Java EE web applications.", "download": "/asset/download/123", "url": "https://dzone.com/refcardz/struts2"}, {"number": "Refcard #013", "title": "RSS and Atom", "subtitle": "Build a Subscribable Feed", "description": "Guides you through creating and serving, or subscribing to and parsing feeds, using RSS and Atom.", "download": "/asset/download/37", "url": "https://dzone.com/refcardz/rss-and-atom"}, {"number": "Refcard #009", "title": "Flexible Rails: Flex 3 on Rails 2", "subtitle": "Flex UI on Ruby Web Apps", "description": "Provides an overview of Flex and Rails and how they can be used together to build a simple Flex+Rails application using XML over HTTPService.", "download": "/asset/download/22", "url": "https://dzone.com/refcardz/flexible-rails"}, {"number": "Refcard #001", "title": "GWT Style, Configuration and JSNI Reference", "subtitle": "Using the Google Web Toolkit", "description": "Introduces Ajax, a group interrelated techniques used in client-side web development for creating asynchronous web applications.", "download": "/asset/download/6", "url": "https://dzone.com/refcardz/gwt-style-configuration-and-js"}]